#!/usr/bin/env python
# -*- coding: utf-8 -*-
"""
__title__ = ''
__author__ = 'Mad Dragon'
__mtime__ = '2019/1/8'
# 我不懂什么叫年少轻狂，只知道胜者为王
              ┏┓      ┏┓
            ┏┛┻━━━┛┻┓
            ┃      ☃      ┃
            ┃  ┳┛  ┗┳  ┃
            ┃      ┻      ┃
            ┗━┓      ┏━┛
                ┃      ┗━━━┓
                ┃  神兽保佑    ┣┓
                ┃　永无BUG！   ┏┛
                ┗┓┓┏━┳┓┏┛
                  ┃┫┫  ┃┫┫
                  ┗┻┛  ┗┻┛
"""

import requests
import json
import pymysql
from datetime import datetime, time


# bookData = {"bookId": "10754117203183504", "bookName": "本命非后", "vs": [{"vN": "正文卷", "cCnt": 32, "cs": [
#     {"uuid": 1, "cN": "第1章 斩草除根", "id": "28867874342419210", "uT": "7个月前", "cnt": 3486, "fS": 0, "sS": 0},
#     {"uuid": 2, "cN": "第2章 暴风雨", "id": "29131109926474429", "uT": "6个月前", "cnt": 3999, "fS": 0, "sS": 0},
#     {"uuid": 3, "cN": "第3章 献上战术", "id": "29171716696025100", "uT": "6个月前", "cnt": 2124, "fS": 0, "sS": 0},
#     {"uuid": 4, "cN": "第4章 山中遇袭", "id": "29174907318362511", "uT": "6个月前", "cnt": 4955, "fS": 0, "sS": 0},
#     {"uuid": 5, "cN": "第5章 失明", "id": "29196309160198573", "uT": "6个月前", "cnt": 4015, "fS": 0, "sS": 0},
#     {"uuid": 6, "cN": "第6章 黄金甲", "id": "29198724818409752", "uT": "6个月前", "cnt": 5339, "fS": 0, "sS": 0},
#     {"uuid": 7, "cN": "第7章 吃人的树", "id": "29223732778466049", "uT": "6个月前", "cnt": 7712, "fS": 0, "sS": 0},
#     {"uuid": 8, "cN": "第8章 寄生", "id": "29270257496457730", "uT": "6个月前", "cnt": 4029, "fS": 0, "sS": 0},
#     {"uuid": 9, "cN": "第9章 玉玺再现", "id": "29285222220237023", "uT": "6个月前", "cnt": 3099, "fS": 0, "sS": 0},
#     {"uuid": 10, "cN": "第10章 海底", "id": "29286587485288854", "uT": "6个月前", "cnt": 4190, "fS": 0, "sS": 0},
#     {"uuid": 11, "cN": "第11章 迷路竹林", "id": "29290811323555638", "uT": "6个月前", "cnt": 4239, "fS": 0, "sS": 0},
#     {"uuid": 12, "cN": "第12章 上路", "id": "29293141885352188", "uT": "6个月前", "cnt": 4061, "fS": 0, "sS": 0},
#     {"uuid": 13, "cN": "第13章 夜谈", "id": "29361344068420884", "uT": "6个月前", "cnt": 4592, "fS": 0, "sS": 0},
#     {"uuid": 14, "cN": "第14章 丑事", "id": "29384368058171064", "uT": "6个月前", "cnt": 4379, "fS": 0, "sS": 0},
#     {"uuid": 15, "cN": "第15章 小产", "id": "29406707781752606", "uT": "6个月前", "cnt": 4016, "fS": 0, "sS": 0},
#     {"uuid": 16, "cN": "第16章 抓药", "id": "29501456635757787", "uT": "6个月前", "cnt": 2062, "fS": 0, "sS": 0},
#     {"uuid": 17, "cN": "第17章 从军", "id": "29649272508107441", "uT": "6个月前", "cnt": 2461, "fS": 0, "sS": 0},
#     {"uuid": 18, "cN": "第18章 未婚夫", "id": "29956279982261815", "uT": "5个月前", "cnt": 2837, "fS": 0, "sS": 0},
#     {"uuid": 19, "cN": "第19章 水蛭", "id": "29959182308607036", "uT": "5个月前", "cnt": 3282, "fS": 0, "sS": 0},
#     {"uuid": 20, "cN": "第20章 屠杀皇子", "id": "30079757879761589", "uT": "5个月前", "cnt": 2015, "fS": 0, "sS": 0},
#     {"uuid": 21, "cN": "第21章 装傻", "id": "30099914981096847", "uT": "5个月前", "cnt": 2100, "fS": 0, "sS": 0},
#     {"uuid": 22, "cN": "第22章 黑影", "id": "30100535329533948", "uT": "5个月前", "cnt": 2136, "fS": 0, "sS": 0},
#     {"uuid": 23, "cN": "第23章 鱼刺", "id": "30102643071541999", "uT": "5个月前", "cnt": 2004, "fS": 0, "sS": 0},
#     {"uuid": 24, "cN": "第24章 烈火石", "id": "30123523338754667", "uT": "5个月前", "cnt": 2111, "fS": 0, "sS": 0},
#     {"uuid": 25, "cN": "第25章 别苑", "id": "30124069604282498", "uT": "5个月前", "cnt": 2067, "fS": 0, "sS": 0},
#     {"uuid": 26, "cN": "第26章 不得靠近", "id": "30126331160812339", "uT": "5个月前", "cnt": 3549, "fS": 0, "sS": 0},
#     {"uuid": 27, "cN": "第27章 仇家", "id": "30146951580846993", "uT": "5个月前", "cnt": 4190, "fS": 0, "sS": 0},
#     {"uuid": 28, "cN": "第28章 拔剑", "id": "30147581604670691", "uT": "5个月前", "cnt": 2275, "fS": 0, "sS": 0},
#     {"uuid": 29, "cN": "第29章 红色石头", "id": "30149065246557286", "uT": "5个月前", "cnt": 2085, "fS": 0, "sS": 0},
#     {"uuid": 30, "cN": "第30章 不知何地", "id": "30172891828155907", "uT": "5个月前", "cnt": 2015, "fS": 0, "sS": 0},
#     {"uuid": 31, "cN": "第31章 逃跑", "id": "30196601657703797", "uT": "5个月前", "cnt": 2093, "fS": 0, "sS": 0},
#     {"uuid": 32, "cN": "第32章 锁骨图腾", "id": "30209982357803078", "uT": "5个月前", "cnt": 2024, "fS": 0, "sS": 0}], "vS": 0,
#                                                                        "wC": 105541}, {"vN": "正文卷", "cCnt": 167, "cs": [
#     {"uuid": 33, "cN": "第33章 寒冷", "id": "30235869736750614", "uT": "5个月前", "cnt": 2381, "fS": 1, "sS": 0},
#     {"uuid": 34, "cN": "第34章 合作", "id": "30265393073190195", "uT": "5个月前", "cnt": 2049, "fS": 1, "sS": 0},
#     {"uuid": 35, "cN": "第35章 阳气", "id": "30275136235945131", "uT": "5个月前", "cnt": 2007, "fS": 1, "sS": 0},
#     {"uuid": 36, "cN": "第36章 十里荒村", "id": "30303953025161457", "uT": "5个月前", "cnt": 2079, "fS": 1, "sS": 0},
#     {"uuid": 37, "cN": "第37章 抓贼", "id": "30322048276663502", "uT": "5个月前", "cnt": 2005, "fS": 1, "sS": 0},
#     {"uuid": 38, "cN": "第38章 半干尸", "id": "30342486401785176", "uT": "5个月前", "cnt": 4018, "fS": 1, "sS": 0},
#     {"uuid": 39, "cN": "第39章 半夜送餐", "id": "30360438300134007", "uT": "5个月前", "cnt": 4011, "fS": 1, "sS": 0},
#     {"uuid": 40, "cN": "第40章 梦魇", "id": "30399496729585490", "uT": "5个月前", "cnt": 4007, "fS": 1, "sS": 0},
#     {"uuid": 41, "cN": "第41章 解药", "id": "30415986182070642", "uT": "5个月前", "cnt": 4017, "fS": 1, "sS": 0},
#     {"uuid": 42, "cN": "第42章 喃喃耳边细语", "id": "30442387896477636", "uT": "5个月前", "cnt": 4063, "fS": 1, "sS": 0},
#     {"uuid": 43, "cN": "第43章 点名遭殃", "id": "30468600339610245", "uT": "5个月前", "cnt": 4010, "fS": 1, "sS": 0},
#     {"uuid": 44, "cN": "第44章 宫彻有苦说不出", "id": "30483509251435983", "uT": "5个月前", "cnt": 4046, "fS": 1, "sS": 0},
#     {"uuid": 45, "cN": "第45章 流言蜚语惹人恼", "id": "30507572323842120", "uT": "5个月前", "cnt": 4009, "fS": 1, "sS": 0},
#     {"uuid": 46, "cN": "第46章 深入十里荒村", "id": "30536173054523185", "uT": "5个月前", "cnt": 4005, "fS": 1, "sS": 0},
#     {"uuid": 47, "cN": "第47章 花开", "id": "30555291849420043", "uT": "4个月前", "cnt": 4071, "fS": 1, "sS": 0},
#     {"uuid": 48, "cN": "第48章 死里逃生", "id": "30577154306632064", "uT": "4个月前", "cnt": 4029, "fS": 1, "sS": 0},
#     {"uuid": 49, "cN": "第49章 方唐母亲？", "id": "30604567457133155", "uT": "4个月前", "cnt": 4011, "fS": 1, "sS": 0},
#     {"uuid": 50, "cN": "第50章 安全回府", "id": "30624914062033610", "uT": "4个月前", "cnt": 4042, "fS": 1, "sS": 0},
#     {"uuid": 51, "cN": "第51章 拉拢皇子逃跑", "id": "30655147691460895", "uT": "4个月前", "cnt": 4055, "fS": 1, "sS": 0},
#     {"uuid": 52, "cN": "第52章 规划路线实施计划", "id": "30677730611691807", "uT": "4个月前", "cnt": 4030, "fS": 1, "sS": 0},
#     {"uuid": 53, "cN": "第53章 落网", "id": "30703145001813363", "uT": "4个月前", "cnt": 4038, "fS": 1, "sS": 0},
#     {"uuid": 54, "cN": "第54章 桃花运", "id": "30715493029111382", "uT": "4个月前", "cnt": 4043, "fS": 1, "sS": 0},
#     {"uuid": 55, "cN": "第55章 口无遮拦惹祸上身", "id": "30748644830195708", "uT": "4个月前", "cnt": 4048, "fS": 1, "sS": 0},
#     {"uuid": 56, "cN": "第56章 小贼引狼入室", "id": "30758458835445993", "uT": "4个月前", "cnt": 4006, "fS": 1, "sS": 0},
#     {"uuid": 57, "cN": "第57章 兴师动众自掘坟墓", "id": "30777370623451876", "uT": "4个月前", "cnt": 4028, "fS": 1, "sS": 0},
#     {"uuid": 58, "cN": "第58章 不守妇道的是谁", "id": "30806841627878653", "uT": "4个月前", "cnt": 4025, "fS": 1, "sS": 0},
#     {"uuid": 59, "cN": "第59章 不可靠的女人的关系", "id": "30835255254011093", "uT": "4个月前", "cnt": 4027, "fS": 1, "sS": 0},
#     {"uuid": 60, "cN": "第60章 虚惊一场", "id": "30852944874997253", "uT": "4个月前", "cnt": 4059, "fS": 1, "sS": 0},
#     {"uuid": 61, "cN": "第61章 得理不饶人", "id": "30888138392446422", "uT": "4个月前", "cnt": 4028, "fS": 1, "sS": 0},
#     {"uuid": 62, "cN": "第62章 活生生的诱饵", "id": "30899144516363911", "uT": "4个月前", "cnt": 4002, "fS": 1, "sS": 0},
#     {"uuid": 63, "cN": "第63章 渔夫剜心", "id": "30929646025424688", "uT": "4个月前", "cnt": 4020, "fS": 1, "sS": 0},
#     {"uuid": 64, "cN": "第64章 宝弟", "id": "30951522962947445", "uT": "4个月前", "cnt": 4017, "fS": 1, "sS": 0},
#     {"uuid": 65, "cN": "第65章 医治的代价", "id": "30974843556171273", "uT": "4个月前", "cnt": 4014, "fS": 1, "sS": 0},
#     {"uuid": 66, "cN": "第66章 下毒的目标", "id": "30997671065061424", "uT": "4个月前", "cnt": 4004, "fS": 1, "sS": 0},
#     {"uuid": 67, "cN": "第67章 下半辈子的饭票", "id": "31026803556181629", "uT": "4个月前", "cnt": 4056, "fS": 1, "sS": 0},
#     {"uuid": 68, "cN": "第68章 村子消失", "id": "31046903201752356", "uT": "4个月前", "cnt": 4006, "fS": 1, "sS": 0},
#     {"uuid": 69, "cN": "第69章 差点压死镇守", "id": "31068067165502668", "uT": "4个月前", "cnt": 4007, "fS": 1, "sS": 0},
#     {"uuid": 70, "cN": "第70章 断魂山遇熟人", "id": "31093904644110543", "uT": "4个月前", "cnt": 4010, "fS": 1, "sS": 0},
#     {"uuid": 71, "cN": "第71章 断魂山的秘密", "id": "31114113261207005", "uT": "4个月前", "cnt": 4011, "fS": 1, "sS": 0},
#     {"uuid": 72, "cN": "第72章 断魂山惊梦", "id": "31131849045354941", "uT": "4个月前", "cnt": 4031, "fS": 1, "sS": 0},
#     {"uuid": 73, "cN": "第73章 虫患的真正原因", "id": "31154691045141255", "uT": "4个月前", "cnt": 4012, "fS": 1, "sS": 0},
#     {"uuid": 74, "cN": "第74章 一觉多了一个贤内助", "id": "31177764385196128", "uT": "4个月前", "cnt": 4038, "fS": 1, "sS": 0},
#     {"uuid": 75, "cN": "第75章 口是心非的保护", "id": "31206703875439802", "uT": "4个月前", "cnt": 4013, "fS": 1, "sS": 0},
#     {"uuid": 76, "cN": "第76章 沉睡之中的陪伴", "id": "31228274286873101", "uT": "4个月前", "cnt": 4021, "fS": 1, "sS": 0},
#     {"uuid": 77, "cN": "第77章 醒酒汤", "id": "31250436867764467", "uT": "4个月前", "cnt": 4025, "fS": 1, "sS": 0},
#     {"uuid": 78, "cN": "第78章 欠收拾就该收拾", "id": "31276314849169856", "uT": "3个月前", "cnt": 4060, "fS": 1, "sS": 0},
#     {"uuid": 79, "cN": "第79章 食色性也", "id": "31299716791025048", "uT": "3个月前", "cnt": 4002, "fS": 1, "sS": 0},
#     {"uuid": 80, "cN": "第80章 忘了方唐重新认识你", "id": "31317183600864747", "uT": "3个月前", "cnt": 4057, "fS": 1, "sS": 0},
#     {"uuid": 81, "cN": "第81章 小爷有仇必报", "id": "31346115562989923", "uT": "3个月前", "cnt": 4027, "fS": 1, "sS": 0},
#     {"uuid": 82, "cN": "第82章 刺杀不成", "id": "31370298381443668", "uT": "3个月前", "cnt": 4011, "fS": 1, "sS": 0},
#     {"uuid": 83, "cN": "第83章 她也是一个女人", "id": "31392818766083688", "uT": "3个月前", "cnt": 4008, "fS": 1, "sS": 0},
#     {"uuid": 84, "cN": "第84章 深深的羁绊", "id": "31412377266252546", "uT": "3个月前", "cnt": 4029, "fS": 1, "sS": 0},
#     {"uuid": 85, "cN": "第85章 蜂毒", "id": "31438848498213244", "uT": "3个月前", "cnt": 4045, "fS": 1, "sS": 0},
#     {"uuid": 86, "cN": "第86章 美男子图", "id": "31462282628463806", "uT": "3个月前", "cnt": 4009, "fS": 1, "sS": 0},
#     {"uuid": 87, "cN": "第87章 投毒的凶手", "id": "31494332203527260", "uT": "3个月前", "cnt": 4059, "fS": 1, "sS": 0},
#     {"uuid": 88, "cN": "第88章 嗜血怪物", "id": "31508830130266800", "uT": "3个月前", "cnt": 4031, "fS": 1, "sS": 0},
#     {"uuid": 89, "cN": "第89章 禁闭", "id": "31531932500014386", "uT": "3个月前", "cnt": 4067, "fS": 1, "sS": 0},
#     {"uuid": 90, "cN": "第90章 通敌罪过", "id": "31563004442957319", "uT": "3个月前", "cnt": 4021, "fS": 1, "sS": 0},
#     {"uuid": 91, "cN": "第91章 这个世界上没有配不配", "id": "31579799102849920", "uT": "3个月前", "cnt": 4011, "fS": 1, "sS": 0},
#     {"uuid": 92, "cN": "第92章 魂不守舍", "id": "31603008570625458", "uT": "3个月前", "cnt": 4034, "fS": 1, "sS": 0},
#     {"uuid": 93, "cN": "第93章 落井下石", "id": "31623001126834040", "uT": "3个月前", "cnt": 4022, "fS": 1, "sS": 0},
#     {"uuid": 94, "cN": "第94章 隔岸观火", "id": "31647723758848191", "uT": "3个月前", "cnt": 4031, "fS": 1, "sS": 0},
#     {"uuid": 95, "cN": "第95章 真面目", "id": "31680078277891244", "uT": "3个月前", "cnt": 4004, "fS": 1, "sS": 0},
#     {"uuid": 96, "cN": "第96章 艾府女管家", "id": "31694764366954447", "uT": "3个月前", "cnt": 4051, "fS": 1, "sS": 0},
#     {"uuid": 97, "cN": "第97章 以牙还牙", "id": "31711481182026614", "uT": "3个月前", "cnt": 4021, "fS": 1, "sS": 0},
#     {"uuid": 98, "cN": "第98章 眼角朱红", "id": "31748838014121554", "uT": "3个月前", "cnt": 4008, "fS": 1, "sS": 0},
#     {"uuid": 99, "cN": "第99章 你一定长寿", "id": "31765058777343301", "uT": "3个月前", "cnt": 4029, "fS": 1, "sS": 0},
#     {"uuid": 100, "cN": "第100章 算计", "id": "31784924862700068", "uT": "3个月前", "cnt": 4011, "fS": 1, "sS": 0},
#     {"uuid": 101, "cN": "第101章 遍体鳞伤怎怕再多伤痕", "id": "31808280641263005", "uT": "3个月前", "cnt": 4004, "fS": 1, "sS": 0},
#     {"uuid": 102, "cN": "第102章 来得太晚了我不想要了", "id": "31830558362902307", "uT": "3个月前", "cnt": 4018, "fS": 1, "sS": 0},
#     {"uuid": 103, "cN": "第103 应该不应该成为枷锁", "id": "31855598817303940", "uT": "3个月前", "cnt": 4029, "fS": 1, "sS": 0},
#     {"uuid": 104, "cN": "第104章 陈年冰封", "id": "31873796332660325", "uT": "3个月前", "cnt": 4015, "fS": 1, "sS": 0},
#     {"uuid": 105, "cN": "第105章 紫萝被杀", "id": "31898856124681476", "uT": "3个月前", "cnt": 4008, "fS": 1, "sS": 0},
#     {"uuid": 106, "cN": "第106章 一不小心扫荡了", "id": "31920057165000957", "uT": "3个月前", "cnt": 4028, "fS": 1, "sS": 0},
#     {"uuid": 107, "cN": "第107章 整根老油条", "id": "11904400804980000", "uT": "2个月前", "cnt": 4017, "fS": 1, "sS": 0},
#     {"uuid": 108, "cN": "第108章 家事莫扰", "id": "31972455757686525", "uT": "2个月前", "cnt": 4009, "fS": 1, "sS": 0},
#     {"uuid": 109, "cN": "第109章 捉拿逆子", "id": "31995510323527092", "uT": "2个月前", "cnt": 4017, "fS": 1, "sS": 0},
#     {"uuid": 110, "cN": "第110章 丢人？？", "id": "32018751998271026", "uT": "2个月前", "cnt": 4010, "fS": 1, "sS": 0},
#     {"uuid": 111, "cN": "第111章 不可言喻的病", "id": "32038549929267679", "uT": "2个月前", "cnt": 4001, "fS": 1, "sS": 0},
#     {"uuid": 112, "cN": "第112章 栽赃陷害", "id": "32066285225352338", "uT": "2个月前", "cnt": 4032, "fS": 1, "sS": 0},
#     {"uuid": 113, "cN": "第113章 打小报告", "id": "32089132018608778", "uT": "2个月前", "cnt": 4060, "fS": 1, "sS": 0},
#     {"uuid": 114, "cN": "第114章 重见天日", "id": "32118567332888918", "uT": "2个月前", "cnt": 4009, "fS": 1, "sS": 0},
#     {"uuid": 115, "cN": "第115章 贼人就在眼皮子地下", "id": "32142735387443241", "uT": "2个月前", "cnt": 4014, "fS": 1, "sS": 0},
#     {"uuid": 116, "cN": "第116章 孤男寡女，甚是危险", "id": "32157869770767798", "uT": "2个月前", "cnt": 4014, "fS": 1, "sS": 0},
#     {"uuid": 117, "cN": "第117章 用错药", "id": "32180849713481510", "uT": "2个月前", "cnt": 4006, "fS": 1, "sS": 0},
#     {"uuid": 118, "cN": "第118章 执着的苦痛", "id": "32203444199548935", "uT": "2个月前", "cnt": 4042, "fS": 1, "sS": 0},
#     {"uuid": 119, "cN": "第119章 觅得踪迹", "id": "32226004316440230", "uT": "2个月前", "cnt": 4017, "fS": 1, "sS": 0},
#     {"uuid": 120, "cN": "第120章 藤蔓花开", "id": "32250145249790493", "uT": "2个月前", "cnt": 4018, "fS": 1, "sS": 0},
#     {"uuid": 121, "cN": "第121章 毒药还是解药？", "id": "32274061258603379", "uT": "2个月前", "cnt": 4024, "fS": 1, "sS": 0},
#     {"uuid": 122, "cN": "第122章 温柔的颜色", "id": "32296620297692128", "uT": "2个月前", "cnt": 4004, "fS": 1, "sS": 0},
#     {"uuid": 123, "cN": "第123章 重蹈覆辙", "id": "32314388580381268", "uT": "2个月前", "cnt": 4010, "fS": 1, "sS": 0},
#     {"uuid": 124, "cN": "第124章 该来的不会缺席", "id": "32337520193252439", "uT": "2个月前", "cnt": 4008, "fS": 1, "sS": 0},
#     {"uuid": 125, "cN": "第125章 想要的都要自己去争取", "id": "32368702999869870", "uT": "2个月前", "cnt": 4024, "fS": 1, "sS": 0},
#     {"uuid": 126, "cN": "第126章 隐忍的痛，别样的美", "id": "32385688801298807", "uT": "2个月前", "cnt": 4008, "fS": 1, "sS": 0},
#     {"uuid": 127, "cN": "第127章 诞女显现", "id": "32412778757215663", "uT": "2个月前", "cnt": 4005, "fS": 1, "sS": 0},
#     {"uuid": 128, "cN": "第128章 易主而栖", "id": "32430154046648514", "uT": "2个月前", "cnt": 4017, "fS": 1, "sS": 0},
#     {"uuid": 129, "cN": "第129章 天井汤", "id": "32453522164909888", "uT": "2个月前", "cnt": 4014, "fS": 1, "sS": 0},
#     {"uuid": 130, "cN": "第130章 狮子大开口", "id": "32476629072718331", "uT": "2个月前", "cnt": 4016, "fS": 1, "sS": 0},
#     {"uuid": 131, "cN": "第131章 狗的主人是谁", "id": "32499849833903041", "uT": "2个月前", "cnt": 4015, "fS": 1, "sS": 0},
#     {"uuid": 132, "cN": "第132章 斐然被掳走", "id": "32526047513080588", "uT": "2个月前", "cnt": 4031, "fS": 1, "sS": 0},
#     {"uuid": 133, "cN": "第133章 我去哪里谁也不能决定", "id": "32552663961655902", "uT": "2个月前", "cnt": 4020, "fS": 1, "sS": 0},
#     {"uuid": 134, "cN": "第134章 洒脱之中的无奈", "id": "32575455215734918", "uT": "2个月前", "cnt": 4033, "fS": 1, "sS": 0},
#     {"uuid": 135, "cN": "第135章 乱点鸳鸯", "id": "32606035377734087", "uT": "2个月前", "cnt": 4034, "fS": 1, "sS": 0},
#     {"uuid": 136, "cN": "第136章 景妃造访", "id": "32615666555825762", "uT": "2个月前", "cnt": 4042, "fS": 1, "sS": 0},
#     {"uuid": 137, "cN": "第137章 乱叫的疯狗", "id": "32645861807129402", "uT": "2个月前", "cnt": 4038, "fS": 1, "sS": 0},
#     {"uuid": 138, "cN": "第138章 最后一口气只为了靠近你", "id": "32662217842500119", "uT": "2个月前", "cnt": 4018, "fS": 1, "sS": 0},
#     {"uuid": 139, "cN": "第139章 修身养性保长命", "id": "32699593715989359", "uT": "1个月前", "cnt": 4010, "fS": 1, "sS": 0},
#     {"uuid": 140, "cN": "第140章 以后咱俩就是一条线上的了", "id": "32702565851735421", "uT": "1个月前", "cnt": 4004, "fS": 1, "sS": 0},
#     {"uuid": 141, "cN": "第141章 神明不会让善良的人委屈", "id": "32731754427123404", "uT": "1个月前", "cnt": 4046, "fS": 1, "sS": 0},
#     {"uuid": 142, "cN": "第142章 荒山野岭遇故人", "id": "32761374423362954", "uT": "1个月前", "cnt": 4014, "fS": 1, "sS": 0},
#     {"uuid": 143, "cN": "第143章 本源自有他的归宿，何必强求", "id": "32778245040251322", "uT": "1个月前", "cnt": 4008, "fS": 1, "sS": 0},
#     {"uuid": 144, "cN": "第144章 我的人就是要护短", "id": "32815314889495289", "uT": "1个月前", "cnt": 4015, "fS": 1, "sS": 0},
#     {"uuid": 145, "cN": "第145章 演戏我在行", "id": "32830817869844258", "uT": "1个月前", "cnt": 4032, "fS": 1, "sS": 0},
#     {"uuid": 146, "cN": "第146章 控制不住的心", "id": "32854751309407494", "uT": "1个月前", "cnt": 4060, "fS": 1, "sS": 0},
#     {"uuid": 147, "cN": "第147章 艾府之下的密道", "id": "32877146587369884", "uT": "1个月前", "cnt": 4069, "fS": 1, "sS": 0},
#     {"uuid": 148, "cN": "第148章 上梁不正下梁呢", "id": "32900910104208572", "uT": "1个月前", "cnt": 4047, "fS": 1, "sS": 0},
#     {"uuid": 149, "cN": "第149章 水玉，对我有何用", "id": "32923674239804373", "uT": "1个月前", "cnt": 4028, "fS": 1, "sS": 0},
#     {"uuid": 150, "cN": "第150章 交朋友是需要立场的", "id": "32956124600270443", "uT": "1个月前", "cnt": 4015, "fS": 1, "sS": 0},
#     {"uuid": 151, "cN": "第151章 不过是不值钱的东西", "id": "32976659123819419", "uT": "1个月前", "cnt": 4017, "fS": 1, "sS": 0},
#     {"uuid": 152, "cN": "第152章 有眼无珠既是无用", "id": "32998967965033462", "uT": "1个月前", "cnt": 4011, "fS": 1, "sS": 0},
#     {"uuid": 153, "cN": "第153章 人就是得服老", "id": "33014058876859013", "uT": "1个月前", "cnt": 4008, "fS": 1, "sS": 0},
#     {"uuid": 154, "cN": "第154章 你值不值钱看我的心情", "id": "33042950034272299", "uT": "1个月前", "cnt": 4015, "fS": 1, "sS": 0},
#     {"uuid": 155, "cN": "第155章 动情的话反而更容易伤心", "id": "33072002534416406", "uT": "1个月前", "cnt": 4003, "fS": 1, "sS": 0},
#     {"uuid": 156, "cN": "第156章 永不安分的躁动", "id": "33085942948734002", "uT": "1个月前", "cnt": 4006, "fS": 1, "sS": 0},
#     {"uuid": 157, "cN": "第157章 羊入虎口，谁是羊", "id": "33118272236948741", "uT": "1个月前", "cnt": 4008, "fS": 1, "sS": 0},
#     {"uuid": 158, "cN": "第158章 你是明灯", "id": "33139786001865055", "uT": "1个月前", "cnt": 4038, "fS": 1, "sS": 0},
#     {"uuid": 159, "cN": "第159章 永远的仇家", "id": "33162335376458597", "uT": "1个月前", "cnt": 4018, "fS": 1, "sS": 0},
#     {"uuid": 160, "cN": "第160章 良善，谈何容易", "id": "33175021626119845", "uT": "1个月前", "cnt": 4028, "fS": 1, "sS": 0},
#     {"uuid": 161, "cN": "第161章 我的归宿就是我自己", "id": "33201249386332914", "uT": "1个月前", "cnt": 4021, "fS": 1, "sS": 0},
#     {"uuid": 162, "cN": "第162章 谁来偿命？", "id": "33232281864464321", "uT": "1个月前", "cnt": 4005, "fS": 1, "sS": 0},
#     {"uuid": 163, "cN": "第163章 干涉", "id": "33255869030142866", "uT": "1个月前", "cnt": 4014, "fS": 1, "sS": 0},
#     {"uuid": 164, "cN": "第164章 双刃之痕", "id": "33271286360291674", "uT": "1个月前", "cnt": 4027, "fS": 1, "sS": 0},
#     {"uuid": 165, "cN": "第165章 报应来的太快", "id": "33303206559933338", "uT": "1个月前", "cnt": 4035, "fS": 1, "sS": 0},
#     {"uuid": 166, "cN": "第166章 雅舞居遗愿", "id": "33325816070008649", "uT": "1个月前", "cnt": 4033, "fS": 1, "sS": 0},
#     {"uuid": 167, "cN": "第167章 不喜欢我的人被挟持", "id": "33337497027162729", "uT": "1个月前", "cnt": 4059, "fS": 1, "sS": 0},
#     {"uuid": 168, "cN": "第168章 对我指手画脚？滚！", "id": "33361228599362087", "uT": "1个月前", "cnt": 4023, "fS": 1, "sS": 0},
#     {"uuid": 169, "cN": "第169章 再久也不是永远", "id": "33394327755829401", "uT": "29天前", "cnt": 4017, "fS": 1, "sS": 0},
#     {"uuid": 170, "cN": "第170章 选择还是支配", "id": "33416304314087097", "uT": "28天前", "cnt": 4025, "fS": 1, "sS": 0},
#     {"uuid": 171, "cN": "第171章 莫心与宫家有关系？", "id": "33427627708588564", "uT": "28天前", "cnt": 4014, "fS": 1, "sS": 0},
#     {"uuid": 172, "cN": "第172章 宫黎儿闯下祸", "id": "33451230705278986", "uT": "27天前", "cnt": 4040, "fS": 1, "sS": 0},
#     {"uuid": 173, "cN": "第173章 宫黎儿的恨意", "id": "33474120739900659", "uT": "26天前", "cnt": 4031, "fS": 1, "sS": 0},
#     {"uuid": 174, "cN": "第174章 我的底线，碰不得", "id": "33498591303361676", "uT": "25天前", "cnt": 4021, "fS": 1, "sS": 0},
#     {"uuid": 175, "cN": "第175章 傲度模糊的来历", "id": "33522110821592565", "uT": "24天前", "cnt": 4013, "fS": 1, "sS": 0},
#     {"uuid": 176, "cN": "第176章 劫囚之人", "id": "33550258434839064", "uT": "23天前", "cnt": 4009, "fS": 1, "sS": 0},
#     {"uuid": 177, "cN": "第177章 一梦玉玺", "id": "33567104085356298", "uT": "22天前", "cnt": 4013, "fS": 1, "sS": 0},
#     {"uuid": 178, "cN": "第178章 大男人也是小心眼", "id": "33589765407414720", "uT": "21天前", "cnt": 4053, "fS": 1, "sS": 0},
#     {"uuid": 179, "cN": "第179章 盖了印就是我的了", "id": "33613407051786404", "uT": "20天前", "cnt": 4024, "fS": 1, "sS": 0},
#     {"uuid": 180, "cN": "第180章 我不愿意就是不愿意", "id": "33649111944374187", "uT": "18天前", "cnt": 4025, "fS": 1, "sS": 0},
#     {"uuid": 181, "cN": "第181章 被许会祎暗算", "id": "33658208151129483", "uT": "18天前", "cnt": 4051, "fS": 1, "sS": 0},
#     {"uuid": 182, "cN": "第182章 请柬上的名字只有一个", "id": "33681221368171864", "uT": "17天前", "cnt": 4008, "fS": 1, "sS": 0},
#     {"uuid": 183, "cN": "第183章 女人之间的危机", "id": "33706532968195504", "uT": "16天前", "cnt": 4009, "fS": 1, "sS": 0},
#     {"uuid": 184, "cN": "第184章 从来没有过，不代表不能", "id": "33735237586406127", "uT": "15天前", "cnt": 4057, "fS": 1, "sS": 0},
#     {"uuid": 185, "cN": "第185章 熔岩之中的孩童", "id": "33758554953883348", "uT": "14天前", "cnt": 4062, "fS": 1, "sS": 0},
#     {"uuid": 186, "cN": "第186章 山中悍匪", "id": "33781956875213593", "uT": "13天前", "cnt": 4010, "fS": 1, "sS": 0},
#     {"uuid": 187, "cN": "187章 毒蜘蛛", "id": "33814165927936313", "uT": "11天前", "cnt": 4008, "fS": 1, "sS": 0},
#     {"uuid": 188, "cN": "第188章 昏沉之间的靠近", "id": "33822417347469154", "uT": "11天前", "cnt": 4012, "fS": 1, "sS": 0},
#     {"uuid": 189, "cN": "第198章 新的身份", "id": "33849788659295339", "uT": "10天前", "cnt": 4061, "fS": 1, "sS": 0},
#     {"uuid": 190, "cN": "第190章 深夜山上的野兽", "id": "33874941051143249", "uT": "9天前", "cnt": 4005, "fS": 1, "sS": 0},
#     {"uuid": 191, "cN": "第191章 可疑的没有怀疑的迹象", "id": "33895039072788704", "uT": "8天前", "cnt": 4016, "fS": 1, "sS": 0},
#     {"uuid": 192, "cN": "第192章 小鹿的由来", "id": "33915289297140677", "uT": "7天前", "cnt": 4028, "fS": 1, "sS": 0},
#     {"uuid": 193, "cN": "第193章 似曾相识的地下", "id": "33944043595821866", "uT": "6天前", "cnt": 4008, "fS": 1, "sS": 0},
#     {"uuid": 194, "cN": "第194章 如影随形的冰棺", "id": "33961625566259813", "uT": "5天前", "cnt": 4005, "fS": 1, "sS": 0},
#     {"uuid": 195, "cN": "第195章 草寇之人何谈道义", "id": "33989758398946543", "uT": "4天前", "cnt": 4017, "fS": 1, "sS": 0},
#     {"uuid": 196, "cN": "第196章 重新出现的石头", "id": "34012622664183651", "uT": "3天前", "cnt": 4040, "fS": 1, "sS": 0},
#     {"uuid": 197, "cN": "第197章 寒冰万重山", "id": "34037169736194340", "uT": "2天前", "cnt": 4021, "fS": 1, "sS": 0},
#     {"uuid": 198, "cN": "第198章 决心毁了万重山", "id": "34054423428111432", "uT": "1天前", "cnt": 4018, "fS": 1, "sS": 0},
#     {"uuid": 199, "cN": "第199章 万重山的消失", "id": "34077535731077634", "uT": "8小时前", "cnt": 4016, "fS": 1, "sS": 0}],
#                                                                                        "vS": 1, "wC": 662365}],
#             "chapterTotalCnt": 199}

class load_book(object):
    def __init__(self, host, bookId, cId):
        self.b_host = host
        self.b_bookId = bookId
        self.b_cId = cId
        self.b_link = self.b_link_load()
        self.b_booksData = self.booksData()
        self.mysql_ip = "172.30.34.210"
        self.mysql_user = "root"
        self.mysql_pwd = "root"
        self.mysql_database = "pythonTest"

    # 链接处理
    def b_link_load(self):
        day = datetime.now()
        unix = datetime.timestamp(day)
        return self.b_host + '/ajax/chapter/userChapterList?_csrfToken=&bookId=' + self.b_bookId + '&_=' + str(
            int(
                unix))

    # 抓取api
    def booksData(self):
        heads = {}
        heads['Accept'] = 'application / json, text / javascript, * / *; q = 0.01'
        heads['Accept - Encoding'] = 'gzip, deflate, br'
        heads['Accept - Language'] = 'zh-CN,zh;q=0.9'
        heads['Cookie'] = 'newstatisticUUID=1546996330_2089765158; qdrs=0%7C3%7C0%7C0%7C1; qdgd=1'
        heads['Host'] = self.b_host[7:]
        heads['Referer'] = 'https: // www.xs8.cn / chapter / ' + self.b_bookId + '/ ' + self.b_cId
        heads[
            'User - Agent'] = 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/70.0.3538.67 Safari/537.36'
        heads['X - Requested - With'] = 'XMLHttpRequest'

        try:
            r = requests.get(self.b_link, headers=heads)
            r.encoding = "utr-8"
            jsons = json.loads(r.text)
            return jsons['data']
        except:
            print("获取目录失败,一秒后重试，失败链接：", self.b_link)
            time.seleep(1)
            self.b_link_load()

    # 数据库信息
    def openMySqlConfig(self):
        return pymysql.connect(self.mysql_ip, self.mysql_user, self.mysql_pwd, self.mysql_database)

    # 批量添加 信息
    def batchAdd(self, sql, data_info):
        db = self.openMySqlConfig()
        # 使用cursor()方法获取操作游标
        cursor = db.cursor()
        try:
            # 执行sql语句
            cursor.executemany(sql, data_info)
            # 提交到数据库执行
            db.commit()
            db.close()
            return True
        except:
            # 如果发生错误则回滚
            print("Error: unable to fecth data")
            db.rollback()
            db.close()
            return False

    def saveBooks(self, data_info):
        # data_info = [('12284740304591203', '以婚谋', '99')]
        sql = "INSERT INTO `books` (`book_id`, `book_name`, `chapter_total_cnt`) VALUES (%s, %s, %s) ON DUPLICATE KEY UPDATE book_name= VALUES(book_name),chapter_total_cnt= VALUES(chapter_total_cnt) "
        return self.batchAdd(sql, data_info)

    def saveLinks(self, data_info):
        # data_info = [('32976698553944625', '12284740304591203', '第四章 偏偏男人像是逗弄她上瘾似的', '2', '3', '0')]
        sql = "INSERT INTO `links` (`id`, `books_id`, `book_name`, `cnt`, `uuid`, `fs`, `url`) VALUES (%s, %s, %s, %s, %s, %s, %s) ON DUPLICATE KEY UPDATE  books_id = VALUES (books_id), book_name = VALUES (book_name), cnt = VALUES (cnt), uuid = VALUES (uuid), fs = VALUES (fs), url = VALUES (url)"
        return self.batchAdd(sql, data_info)

    # 获取书本数据
    def getBooksInfo(self):
        booksInfo = []
        booksData = self.booksData()
        bookId = booksData['bookId']
        bookName = booksData['bookName']
        chapterTotalCnt = booksData['chapterTotalCnt']
        booksInfo.append((bookId, bookName, chapterTotalCnt,))
        return booksInfo

    # # print(getBooksInfo(bookData))
    #
    # 获取列表数据
    def getLinksInfo(self):
        links = []
        booksData = self.booksData()
        bookId = booksData['bookId']
        for i in booksData['vs']:
            for j in i['cs']:
                link = self.b_host + '/chapter/' + bookId + '/' + j['id']
                links.append((j['id'], bookId, j['cN'], j['cnt'], j['uuid'], j['fS'], link))
        return links

    # 调度
    def contents_load(self):
        getBooksInfoData = self.getBooksInfo()
        getLinksInfoData = self.getLinksInfo()

        getBooksInfoRes = self.saveBooks(getBooksInfoData)
        getLinksInfoRes = self.saveLinks(getLinksInfoData)

        print('\tbookId： %s \t书名： 《%s》 \t\t章节数： %s \t\t已抓取： %s' % (
            getBooksInfoData[0][0], getBooksInfoData[0][1], getBooksInfoData[0][2], len(getLinksInfoData)))

        if not getBooksInfoRes:
            print('书籍信息存储失败', getBooksInfoData)

        if not getLinksInfoRes:
            print('目录存储失败', getLinksInfoData)


if __name__ == '__main__':
    book = load_book('http://www.xs8.cn', '6972481904230701', '27544848049868148')
    book.contents_load()
