#!/usr/bin/env python
# -*- coding: utf-8 -*-
"""
__title__ = '抓取小说 章节目录'
__author__ = 'Mad Dragon'
__mtime__ = '2019/1/8'
# 我不懂什么叫年少轻狂，只知道胜者为王
              ┏┓      ┏┓
            ┏┛┻━━━┛┻┓
            ┃      ☃      ┃
            ┃  ┳┛  ┗┳  ┃
            ┃      ┻      ┃
            ┗━┓      ┏━┛
                ┃      ┗━━━┓
                ┃  神兽保佑    ┣┓
                ┃　永无BUG！   ┏┛
                ┗┓┓┏━┳┓┏┛
                  ┃┫┫  ┃┫┫
                  ┗┻┛  ┗┻┛
"""
import json
import math
import random
import threading
import time
from datetime import datetime

import moment
import pymysql
import requests

from public.Logger import Logger


class load_book(object):
    def __init__(self, host, pageSize, nex, loops, second, isOpen, maxErrorSize):
        self.b_host = str(host)
        self.b_pageSize = int(pageSize)
        self.b_nex = int(nex)
        self.b_loops = int(loops)
        self.b_second = int(second)
        self.isOpen = isOpen
        self.content = []
        self.mysql_ip = "172.30.34.210"
        self.mysql_user = "root"
        self.mysql_pwd = "root"
        self.mysql_database = "pythonTest"
        self.books_table = "books"
        self.b_links = []
        self.b_error_urls = []
        self.okNum = 0
        self.maxErrorSize = int(maxErrorSize)
        self.errorSize = 0

    # 数据库信息
    def openMySqlConfig(self):
        return pymysql.connect(self.mysql_ip, self.mysql_user, self.mysql_pwd, self.mysql_database)

    # 获取所有bookId
    def getBookCount(self, sql):
        db = self.openMySqlConfig()
        # 使用cursor()方法获取操作游标
        cursor = db.cursor()

        try:
            # 执行SQL语句
            cursor.execute(sql)
            # 获取所有记录列表
            results = cursor.fetchall()
            ids = []
            for row in results:
                book_Id = row[0]
                # 打印结果
                # print(book_Id)
                ids.append(book_Id)
            # 关闭数据库连接
            db.close()
            return ids
        except:
            print("Error: unable to fecth data")
            # 关闭数据库连接
            db.close()
            return []

    # 批量添加 信息
    def batchAdd(self, sql, data_info):
        db = self.openMySqlConfig()
        # 使用cursor()方法获取操作游标
        cursor = db.cursor()
        try:
            # 执行sql语句
            cursor.executemany(sql, data_info)
            # 提交到数据库执行
            db.commit()
            db.close()
            print('\t存储成功')
            return True
        except:
            # 如果发生错误则回滚
            db.rollback()
            db.close()
            logger.debug('存储失败：[ sql ] %s ' % (str(sql)))
            logger.debug('存储失败：[ data_info ] %s ' % (str(data_info)))
            return False

    # 链接处理
    def b_link_load(self, bookId):
        day = datetime.now()
        unix = datetime.timestamp(day)
        # https://www.xs8.cn/ajax/chapter/userChapterList?_csrfToken=&bookId=11445523104584903&_=1547172023217
        return self.b_host + '/ajax/chapter/userChapterList?_csrfToken=&bookId=' + str(bookId) + '&_=' + str(int(unix))

    # 生成连接池
    def b_links_load(self, ids):
        links = []
        for bookId in ids:
            links.append(bookId)
        return links

    # 调接口获取数据
    def get_book_info(self, bookId):
        heads = {}
        heads['Accept'] = 'application/json, text/javascript, */*; q=0.01'
        heads['Accept-Encoding'] = 'gzip, deflate, br'
        heads['Accept-Language'] = 'zh-CN,zh;q=0.9'
        heads['Connection'] = 'keep-alive'
        heads['Cookie'] = 'newstatisticUUID=1547123562_436906659; qdrs=0%7C3%7C0%7C0%7C1; qdgd=1'
        heads['Host'] = self.b_host[7:]
        heads['Referer'] = 'https://www.xs8.cn/book/' + bookId + '#Catalog'
        heads[
            'User-Agent'] = 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/70.0.3538.67 Safari/537.36'
        heads['X-Requested-With'] = 'XMLHttpRequest'
        link = self.b_link_load(bookId)
        bookInfo = {'bookId': '', 'bookName': '', 'chapterTotalCnt': '', 'catalog': ''}
        try:
            if self.isOpen > 0:
                r = requests.get(link, headers=heads)
                r.encoding = "utr-8"
                res = json.loads(r.text)
            else:
                res = json.loads('''{"code": 0, "data": {"bookId": "11653675004256003", "bookName": "裴太太，你已婚！", "vs": [
                {"vN": "第一卷  重生", "cCnt": 79, "cs": [
                    {"uuid": 1, "cN": "第1章 楔子", "id": "31298119050333293", "uT": "4个月前", "cnt": 1042, "fS": 0, "sS": 0},
                    {"uuid": 2, "cN": "第2章 老公", "id": "31298171114617929", "uT": "4个月前", "cnt": 1103, "fS": 0, "sS": 0},
                    {"uuid": 3, "cN": "第3章 第六感", "id": "31320226040671539", "uT": "3个月前", "cnt": 1059, "fS": 0,
                     "sS": 0},
                    {"uuid": 4, "cN": "第4章 表里不一的女人", "id": "31320249396365652", "uT": "3个月前", "cnt": 1024, "fS": 0,
                     "sS": 0},
                    {"uuid": 5, "cN": "第5章 怎么会在家里", "id": "31343372447219852", "uT": "3个月前", "cnt": 1016, "fS": 0,
                     "sS": 0},
                    {"uuid": 6, "cN": "第6章 视之为耻辱", "id": "31343404388527896", "uT": "3个月前", "cnt": 1074, "fS": 0,
                     "sS": 0},
                    {"uuid": 7, "cN": "第7章 装，再继续装。", "id": "31366135500140479", "uT": "3个月前", "cnt": 1080, "fS": 0,
                     "sS": 0},
                    {"uuid": 8, "cN": "第8章 是那个男人！", "id": "31370684669587914", "uT": "3个月前", "cnt": 1039, "fS": 0,
                     "sS": 0},
                    {"uuid": 9, "cN": "第9章 我不喜欢等人！", "id": "31387596624325909", "uT": "3个月前", "cnt": 1033, "fS": 0,
                     "sS": 0},
                    {"uuid": 10, "cN": "第10章 裴先生，请自重。", "id": "31388736134928285", "uT": "3个月前", "cnt": 1026, "fS": 0,
                     "sS": 0},
                    {"uuid": 11, "cN": "第11章 她有强迫症！", "id": "31412099169475144", "uT": "3个月前", "cnt": 1123, "fS": 0,
                     "sS": 0},
                    {"uuid": 12, "cN": "第12章 见你一次打你一次", "id": "31412121166223877", "uT": "3个月前", "cnt": 1042, "fS": 0,
                     "sS": 0},
                    {"uuid": 13, "cN": "第13章 床上的被子被叠成了豆腐块", "id": "31435538399847173", "uT": "3个月前", "cnt": 1021,
                     "fS": 0, "sS": 0},
                    {"uuid": 14, "cN": "第14章 你什么时候有老婆了", "id": "31435573299019252", "uT": "3个月前", "cnt": 1043, "fS": 0,
                     "sS": 0},
                    {"uuid": 15, "cN": "第15章 傅芊芊……转性了？", "id": "31457046795633033", "uT": "3个月前", "cnt": 1034, "fS": 0,
                     "sS": 0},
                    {"uuid": 16, "cN": "第16章 未来嫂子", "id": "31458987326880027", "uT": "3个月前", "cnt": 1086, "fS": 0,
                     "sS": 0},
                    {"uuid": 17, "cN": "第17章 看了感觉都疼", "id": "31481569440451336", "uT": "3个月前", "cnt": 1060, "fS": 0,
                     "sS": 0},
                    {"uuid": 18, "cN": "第18章 演够了吗？", "id": "31481600866431943", "uT": "3个月前", "cnt": 1101, "fS": 0,
                     "sS": 0},
                    {"uuid": 19, "cN": "第19章 你身体怎么样？", "id": "31503027389570119", "uT": "3个月前", "cnt": 1051, "fS": 0,
                     "sS": 0},
                    {"uuid": 20, "cN": "第20章 她是一名军人，不能骂人。", "id": "31503082670008434", "uT": "3个月前", "cnt": 1015,
                     "fS": 0, "sS": 0},
                    {"uuid": 21, "cN": "第21章 合作愉快", "id": "31525713662841438", "uT": "3个月前", "cnt": 1048, "fS": 0,
                     "sS": 0},
                    {"uuid": 22, "cN": "第22章 转学生", "id": "31525729484127390", "uT": "3个月前", "cnt": 1057, "fS": 0,
                     "sS": 0},
                    {"uuid": 23, "cN": "第23章 来者不善", "id": "31548389998588339", "uT": "3个月前", "cnt": 1079, "fS": 0,
                     "sS": 0},
                    {"uuid": 24, "cN": "第24章 打的就是你", "id": "31548454692674969", "uT": "3个月前", "cnt": 1030, "fS": 0,
                     "sS": 0},
                    {"uuid": 25, "cN": "第25章 你叫我裴先生实在是太见外了", "id": "31574531855097605", "uT": "3个月前", "cnt": 1090,
                     "fS": 0, "sS": 0},
                    {"uuid": 26, "cN": "第26章 耐性还真差", "id": "31574725135612869", "uT": "3个月前", "cnt": 1038, "fS": 0,
                     "sS": 0},
                    {"uuid": 27, "cN": "第27章 心太大了", "id": "31595388491478780", "uT": "3个月前", "cnt": 1055, "fS": 0,
                     "sS": 0},
                    {"uuid": 28, "cN": "第28章 裴烨是不会放过他的", "id": "31595565662669851", "uT": "3个月前", "cnt": 1086, "fS": 0,
                     "sS": 0},
                    {"uuid": 29, "cN": "第29章 好像很有道理！", "id": "31618919296182739", "uT": "3个月前", "cnt": 1091, "fS": 0,
                     "sS": 0},
                    {"uuid": 30, "cN": "第30章 胆儿肥了", "id": "31618967347467030", "uT": "3个月前", "cnt": 1060, "fS": 0,
                     "sS": 0},
                    {"uuid": 31, "cN": "第31章 将学渣傅芊芊给处置了", "id": "31642000428189480", "uT": "3个月前", "cnt": 1034, "fS": 0,
                     "sS": 0},
                    {"uuid": 32, "cN": "第32章 违停也违不到那里好吗？", "id": "31642145135990741", "uT": "3个月前", "cnt": 1037,
                     "fS": 0, "sS": 0},
                    {"uuid": 33, "cN": "第33章 用性命来保护", "id": "31665224671085714", "uT": "3个月前", "cnt": 1039, "fS": 0,
                     "sS": 0},
                    {"uuid": 34, "cN": "第34章 以后应该多笑", "id": "31665401826623330", "uT": "3个月前", "cnt": 1087, "fS": 0,
                     "sS": 0},
                    {"uuid": 35, "cN": "第35章 不向我下跪求饶吗？", "id": "31688611026074292", "uT": "3个月前", "cnt": 1026, "fS": 0,
                     "sS": 0},
                    {"uuid": 36, "cN": "第36章 以后把你的嘴巴和脑子都放干净点", "id": "31688643236255607", "uT": "3个月前", "cnt": 1081,
                     "fS": 0, "sS": 0},
                    {"uuid": 37, "cN": "第37章 身份暴露了", "id": "31698693483886535", "uT": "3个月前", "cnt": 1042, "fS": 0,
                     "sS": 0},
                    {"uuid": 38, "cN": "第38章 身为一个男人", "id": "31698725147005858", "uT": "3个月前", "cnt": 1043, "fS": 0,
                     "sS": 0},
                    {"uuid": 39, "cN": "第39章 夫妻之间", "id": "31735092496322918", "uT": "3个月前", "cnt": 1095, "fS": 0,
                     "sS": 0},
                    {"uuid": 40, "cN": "第40章 恶人先告状", "id": "31735125262832325", "uT": "3个月前", "cnt": 1067, "fS": 0,
                     "sS": 0},
                    {"uuid": 41, "cN": "第41章 你头发都乱了", "id": "31750458833916362", "uT": "3个月前", "cnt": 1034, "fS": 0,
                     "sS": 0},
                    {"uuid": 42, "cN": "第42章 拦腰抱起", "id": "31750487827768771", "uT": "3个月前", "cnt": 1067, "fS": 0,
                     "sS": 0},
                    {"uuid": 43, "cN": "第43章 名不正言不顺", "id": "31773071016316720", "uT": "3个月前", "cnt": 1048, "fS": 0,
                     "sS": 0},
                    {"uuid": 44, "cN": "第44章 视频通话", "id": "31773119894801403", "uT": "3个月前", "cnt": 1056, "fS": 0,
                     "sS": 0},
                    {"uuid": 45, "cN": "第45章 原来你的身材这么好", "id": "31795603494544577", "uT": "3个月前", "cnt": 1058, "fS": 0,
                     "sS": 0},
                    {"uuid": 46, "cN": "第46章 碰瓷？", "id": "31795635459534562", "uT": "3个月前", "cnt": 1033, "fS": 0,
                     "sS": 0},
                    {"uuid": 47, "cN": "第47章 车子还在行驶中，傅芊芊突然打开车门跳下了车。", "id": "31814995011965893", "uT": "3个月前",
                     "cnt": 1038, "fS": 0, "sS": 0},
                    {"uuid": 48, "cN": "第48章 真的有猿粪", "id": "31815623670179806", "uT": "3个月前", "cnt": 1056, "fS": 0,
                     "sS": 0},
                    {"uuid": 49, "cN": "第49章 是谁伤了你？", "id": "31837593501617420", "uT": "3个月前", "cnt": 1023, "fS": 0,
                     "sS": 0},
                    {"uuid": 50, "cN": "第50章 什么事也没有芊芊你的事重要", "id": "31837641578674636", "uT": "3个月前", "cnt": 1083,
                     "fS": 0, "sS": 0},
                    {"uuid": 51, "cN": "第51章 全面瘫痪", "id": "31859368473019965", "uT": "3个月前", "cnt": 1085, "fS": 0,
                     "sS": 0},
                    {"uuid": 52, "cN": "第52章 一个清晰的巴掌印", "id": "31859497321219264", "uT": "3个月前", "cnt": 1073, "fS": 0,
                     "sS": 0},
                    {"uuid": 53, "cN": "第53章 十分钟交卷", "id": "31884381018512397", "uT": "3个月前", "cnt": 1109, "fS": 0,
                     "sS": 0},
                    {"uuid": 54, "cN": "第54章 裴烨恐怕会不高兴", "id": "31884397396281873", "uT": "3个月前", "cnt": 1103, "fS": 0,
                     "sS": 0},
                    {"uuid": 55, "cN": "第55章 他赌赢了", "id": "31907669922637534", "uT": "3个月前", "cnt": 1050, "fS": 0,
                     "sS": 0},
                    {"uuid": 56, "cN": "第56章 他老婆", "id": "31907734345093534", "uT": "3个月前", "cnt": 1078, "fS": 0,
                     "sS": 0},
                    {"uuid": 57, "cN": "第57章 心有灵犀", "id": "31930316743808804", "uT": "3个月前", "cnt": 1035, "fS": 0,
                     "sS": 0},
                    {"uuid": 58, "cN": "第58章 你身上怎么有男人的衣服", "id": "31930348975460295", "uT": "3个月前", "cnt": 1145,
                     "fS": 0, "sS": 0},
                    {"uuid": 59, "cN": "第59章 那不是裴氏集团的总裁裴烨吗？", "id": "31953444343400495", "uT": "3个月前", "cnt": 1062,
                     "fS": 0, "sS": 0},
                    {"uuid": 60, "cN": "第60章 俗不可耐", "id": "31953476843751230", "uT": "3个月前", "cnt": 1321, "fS": 0,
                     "sS": 0},
                    {"uuid": 61, "cN": "第61章 我同意退婚", "id": "31976121767044106", "uT": "3个月前", "cnt": 1092, "fS": 0,
                     "sS": 0},
                    {"uuid": 62, "cN": "第62章 期中考试成绩排名表", "id": "31976153999673984", "uT": "3个月前", "cnt": 1286, "fS": 0,
                     "sS": 0},
                    {"uuid": 63, "cN": "第63章 精英中的学霸", "id": "32005193339150314", "uT": "2个月前", "cnt": 1033, "fS": 0,
                     "sS": 0},
                    {"uuid": 64, "cN": "第64章 送你我们订婚的第一个礼物", "id": "32005209454734442", "uT": "2个月前", "cnt": 1179,
                     "fS": 0, "sS": 0},
                    {"uuid": 65, "cN": "第65章 悔的肠子都青了", "id": "32023795905096620", "uT": "2个月前", "cnt": 1186, "fS": 0,
                     "sS": 0},
                    {"uuid": 66, "cN": "第66章 我是芊芊的男朋友", "id": "32040336655712021", "uT": "2个月前", "cnt": 1131, "fS": 0,
                     "sS": 0},
                    {"uuid": 67, "cN": "第67章 饥不择食", "id": "32051449600148714", "uT": "2个月前", "cnt": 1059, "fS": 0,
                     "sS": 0},
                    {"uuid": 68, "cN": "第68章 做戏就要做足", "id": "32051497909201085", "uT": "2个月前", "cnt": 1056, "fS": 0,
                     "sS": 0},
                    {"uuid": 69, "cN": "第69章 有照片为证", "id": "32069488199442359", "uT": "2个月前", "cnt": 1150, "fS": 0,
                     "sS": 0},
                    {"uuid": 70, "cN": "第70章 眼睛不好，是病！", "id": "32069504307354747", "uT": "2个月前", "cnt": 1132, "fS": 0,
                     "sS": 0},
                    {"uuid": 71, "cN": "第71章 我未婚妻", "id": "32092054221614732", "uT": "2个月前", "cnt": 1052, "fS": 0,
                     "sS": 0},
                    {"uuid": 72, "cN": "第72章 订婚的规则", "id": "32112472748496020", "uT": "2个月前", "cnt": 1044, "fS": 0,
                     "sS": 0},
                    {"uuid": 73, "cN": "第73章 狠狠的吻住", "id": "32115246763055990", "uT": "2个月前", "cnt": 1079, "fS": 0,
                     "sS": 0},
                    {"uuid": 74, "cN": "第74章 难道就不觉得恶心吗？", "id": "32115263154909973", "uT": "2个月前", "cnt": 1074, "fS": 0,
                     "sS": 0},
                    {"uuid": 75, "cN": "第75章 狗急跳墙的把自己给蠢哭了", "id": "32140807184705659", "uT": "2个月前", "cnt": 1130,
                     "fS": 0, "sS": 0},
                    {"uuid": 76, "cN": "第76章 对着床上的一对男女猛拍", "id": "32140839950847295", "uT": "2个月前", "cnt": 1052,
                     "fS": 0, "sS": 0},
                    {"uuid": 77, "cN": "第77章 怎么会是你？", "id": "32161503317443715", "uT": "2个月前", "cnt": 1030, "fS": 0,
                     "sS": 0},
                    {"uuid": 78, "cN": "第78章 只有一个解决办法", "id": "32161536070157946", "uT": "2个月前", "cnt": 1186, "fS": 0,
                     "sS": 0},
                    {"uuid": 79, "cN": "第79章 唇碰在了一起", "id": "32186500541256482", "uT": "2个月前", "cnt": 1076, "fS": 0,
                     "sS": 0}], "vS": 0, "wC": 84841}, {"vN": "第二卷 定情", "cCnt": 266, "cs": [
                    {"uuid": 80, "cN": "第80章 狗粮的摧残", "id": "32186532763558853", "uT": "2个月前", "cnt": 1082, "fS": 1,
                     "sS": 0},
                    {"uuid": 81, "cN": "第81章 他的芊芊比他想象中还要主动", "id": "32207647628388401", "uT": "2个月前", "cnt": 1060,
                     "fS": 1, "sS": 0},
                    {"uuid": 82, "cN": "第82章 在我的房间里做什么？", "id": "32207679826008402", "uT": "2个月前", "cnt": 1139, "fS": 1,
                     "sS": 0},
                    {"uuid": 83, "cN": "第83章 亲自下来请", "id": "32230244248655304", "uT": "2个月前", "cnt": 1060, "fS": 1,
                     "sS": 0},
                    {"uuid": 84, "cN": "第84章 一个人最绝望的是什么？", "id": "32230260356537208", "uT": "2个月前", "cnt": 1045,
                     "fS": 1, "sS": 0},
                    {"uuid": 85, "cN": "第85章 凭什么？想知道？", "id": "32230308696796462", "uT": "2个月前", "cnt": 1039, "fS": 1,
                     "sS": 0},
                    {"uuid": 86, "cN": "第86章 ‘啪啪’打了他们所有人的脸", "id": "32254307354670721", "uT": "2个月前", "cnt": 1059,
                     "fS": 1, "sS": 0},
                    {"uuid": 87, "cN": "第87章 不去，你就是懦夫", "id": "32254339570603835", "uT": "2个月前", "cnt": 1171, "fS": 1,
                     "sS": 0},
                    {"uuid": 88, "cN": "第88章 傅芊芊同学，请你做我的女朋友", "id": "32254371771251892", "uT": "2个月前", "cnt": 1037,
                     "fS": 1, "sS": 0},
                    {"uuid": 89, "cN": "第89章 对我未来的大舅妈不尊重", "id": "32279142714234551", "uT": "2个月前", "cnt": 1065,
                     "fS": 1, "sS": 0},
                    {"uuid": 90, "cN": "第90章 芊芊是我的未婚妻，你未来的大舅妈！", "id": "32279158821819935", "uT": "2个月前", "cnt": 1020,
                     "fS": 1, "sS": 0},
                    {"uuid": 91, "cN": "第91章 旁若无人的撒狗粮", "id": "32279174941419917", "uT": "2个月前", "cnt": 1073, "fS": 1,
                     "sS": 0},
                    {"uuid": 92, "cN": "第92章 不装白莲花了", "id": "32300151833760922", "uT": "2个月前", "cnt": 1028, "fS": 1,
                     "sS": 0},
                    {"uuid": 93, "cN": "第93章 他很好", "id": "32300177327683789", "uT": "2个月前", "cnt": 1118, "fS": 1,
                     "sS": 0},
                    {"uuid": 94, "cN": "第94章 人艰不拆啊", "id": "32300209284134555", "uT": "2个月前", "cnt": 1050, "fS": 1,
                     "sS": 0},
                    {"uuid": 95, "cN": "第95章 不许动！", "id": "32325174299735268", "uT": "2个月前", "cnt": 1136, "fS": 1,
                     "sS": 0},
                    {"uuid": 96, "cN": "第96章 熟悉目光", "id": "32325206260827241", "uT": "2个月前", "cnt": 1078, "fS": 1,
                     "sS": 0},
                    {"uuid": 97, "cN": "第97章 一群蠢货", "id": "32325254566431851", "uT": "2个月前", "cnt": 1100, "fS": 1,
                     "sS": 0},
                    {"uuid": 99, "cN": "第98章 如果它答应你，我就还给你", "id": "32346642987210678", "uT": "2个月前", "cnt": 1022,
                     "fS": 1, "sS": 0},
                    {"uuid": 100, "cN": "第99章 给裴某一个解释", "id": "32346772085111445", "uT": "2个月前", "cnt": 1069, "fS": 1,
                     "sS": 0},
                    {"uuid": 101, "cN": "第100章 你这是在威胁我？", "id": "32346804316742840", "uT": "2个月前", "cnt": 1016, "fS": 1,
                     "sS": 0},
                    {"uuid": 102, "cN": "第101章 甭想从我裴烨身边带走任何人", "id": "32369755802999889", "uT": "2个月前", "cnt": 1024,
                     "fS": 1, "sS": 0},
                    {"uuid": 103, "cN": "第102章 亲亲抱抱举高高", "id": "32369772178813218", "uT": "2个月前", "cnt": 1110, "fS": 1,
                     "sS": 0},
                    {"uuid": 104, "cN": "第103章 我的芊芊穿什么都好看", "id": "32369820233362661", "uT": "2个月前", "cnt": 1074,
                     "fS": 1, "sS": 0},
                    {"uuid": 105, "cN": "第104章 不是不会介意吗？", "id": "32393141905393735", "uT": "2个月前", "cnt": 1127, "fS": 1,
                     "sS": 0},
                    {"uuid": 106, "cN": "第105章 你的未婚妻给你戴绿帽子", "id": "32393153180894410", "uT": "2个月前", "cnt": 1077,
                     "fS": 1, "sS": 0},
                    {"uuid": 107, "cN": "第106章 裴烨有某些方面的变态嗜好？", "id": "32393171156880598", "uT": "2个月前", "cnt": 1063,
                     "fS": 1, "sS": 0},
                    {"uuid": 108, "cN": "第107章 还以为她真的是傅家的女主人了", "id": "32416721277509273", "uT": "2个月前", "cnt": 1040,
                     "fS": 1, "sS": 0},
                    {"uuid": 109, "cN": "第108章 就这么一个宝贝孙女", "id": "32416738164766843", "uT": "2个月前", "cnt": 1065,
                     "fS": 1, "sS": 0},
                    {"uuid": 110, "cN": "第109章 计划万无一失", "id": "32416761277456584", "uT": "2个月前", "cnt": 1230, "fS": 1,
                     "sS": 0},
                    {"uuid": 111, "cN": "第110章 难道我说的不对？", "id": "32440509758874191", "uT": "2个月前", "cnt": 1058, "fS": 1,
                     "sS": 0},
                    {"uuid": 112, "cN": "第111章 还不嫌丢人？", "id": "32440529880150929", "uT": "2个月前", "cnt": 1018, "fS": 1,
                     "sS": 0},
                    {"uuid": 113, "cN": "第112章 逐出傅家", "id": "32440567460366482", "uT": "2个月前", "cnt": 1019, "fS": 1,
                     "sS": 0},
                    {"uuid": 114, "cN": "第113章 把她脸上的妆给我擦了", "id": "32463299667700773", "uT": "2个月前", "cnt": 1111,
                     "fS": 1, "sS": 0},
                    {"uuid": 115, "cN": "第114章 监控录像", "id": "32463311742522020", "uT": "2个月前", "cnt": 1026, "fS": 1,
                     "sS": 0},
                    {"uuid": 116, "cN": "第115章 将我裴家的颜面放在哪里？", "id": "32463331596777049", "uT": "2个月前", "cnt": 1100,
                     "fS": 1, "sS": 0},
                    {"uuid": 117, "cN": "第116章 我的未婚妻受了委屈", "id": "32486364150032603", "uT": "2个月前", "cnt": 1053,
                     "fS": 1, "sS": 0},
                    {"uuid": 118, "cN": "第117章 你当真要撕破脸皮吗？", "id": "32486387527514325", "uT": "2个月前", "cnt": 1316,
                     "fS": 1, "sS": 0},
                    {"uuid": 119, "cN": "第118章 培养感情", "id": "32486435313025968", "uT": "2个月前", "cnt": 1052, "fS": 1,
                     "sS": 0},
                    {"uuid": 120, "cN": "第119章 来而不往非礼也", "id": "32511135129614949", "uT": "2个月前", "cnt": 1149, "fS": 1,
                     "sS": 0},
                    {"uuid": 121, "cN": "第120章 醋坛子打翻了", "id": "32511147210782663", "uT": "2个月前", "cnt": 1098, "fS": 1,
                     "sS": 0},
                    {"uuid": 122, "cN": "第121章 打人不打脸", "id": "32511172689836590", "uT": "2个月前", "cnt": 1020, "fS": 1,
                     "sS": 0},
                    {"uuid": 123, "cN": "第122章 这是我的未婚妻", "id": "32532717339479784", "uT": "2个月前", "cnt": 1018, "fS": 1,
                     "sS": 0},
                    {"uuid": 124, "cN": "第123章 谁喜欢自己的未婚妻总是盯着别的男人瞧呢？", "id": "32532737457386291", "uT": "2个月前",
                     "cnt": 1029, "fS": 1, "sS": 0},
                    {"uuid": 125, "cN": "第124章 芊芊是看上他了？", "id": "32532823080855747", "uT": "2个月前", "cnt": 1034, "fS": 1,
                     "sS": 0},
                    {"uuid": 126, "cN": "第125章 少爷不吃醋便是晴天", "id": "32554863257947886", "uT": "2个月前", "cnt": 1099,
                     "fS": 1, "sS": 0},
                    {"uuid": 127, "cN": "第126章 告白", "id": "32554881244720577", "uT": "2个月前", "cnt": 1025, "fS": 1,
                     "sS": 0},
                    {"uuid": 128, "cN": "第127章 我比任何人都难过", "id": "32554925809423344", "uT": "2个月前", "cnt": 1089, "fS": 1,
                     "sS": 0},
                    {"uuid": 129, "cN": "第128章 不解风情", "id": "32579843857287894", "uT": "2个月前", "cnt": 1061, "fS": 1,
                     "sS": 0},
                    {"uuid": 130, "cN": "第129章 英雄难过美人关", "id": "32579856743211763", "uT": "2个月前", "cnt": 1015, "fS": 1,
                     "sS": 0},
                    {"uuid": 131, "cN": "第130章 我和你一起过去", "id": "32579901827127955", "uT": "2个月前", "cnt": 1068, "fS": 1,
                     "sS": 0},
                    {"uuid": 132, "cN": "第131章 你听错了吧？", "id": "32602070035096993", "uT": "2个月前", "cnt": 1098, "fS": 1,
                     "sS": 0},
                    {"uuid": 133, "cN": "第132章 被人夺了舍", "id": "32602083206641144", "uT": "2个月前", "cnt": 1103, "fS": 1,
                     "sS": 0},
                    {"uuid": 134, "cN": "第133章 想证明自己有多蠢", "id": "32602114348181586", "uT": "2个月前", "cnt": 1052, "fS": 1,
                     "sS": 0},
                    {"uuid": 135, "cN": "第134章 你说我不是傅芊芊，那我是谁？", "id": "32618691580059310", "uT": "2个月前", "cnt": 1034,
                     "fS": 1, "sS": 0},
                    {"uuid": 136, "cN": "第135章 后果自负", "id": "32618703912709657", "uT": "2个月前", "cnt": 1039, "fS": 1,
                     "sS": 0},
                    {"uuid": 137, "cN": "第136章 养得起你", "id": "32618742295079813", "uT": "2个月前", "cnt": 1021, "fS": 1,
                     "sS": 0},
                    {"uuid": 138, "cN": "第137章 她也该换一套衣服", "id": "32648859152912494", "uT": "2个月前", "cnt": 1076, "fS": 1,
                     "sS": 0},
                    {"uuid": 139, "cN": "第138章 改装", "id": "32648876334285927", "uT": "2个月前", "cnt": 1093, "fS": 1,
                     "sS": 0},
                    {"uuid": 140, "cN": "第139章 她这辈子还没有穿过这么短的裙子", "id": "32648894590153576", "uT": "2个月前", "cnt": 1061,
                     "fS": 1, "sS": 0},
                    {"uuid": 141, "cN": "第140章 有没有男朋友？", "id": "32665206048940779", "uT": "2个月前", "cnt": 1042, "fS": 1,
                     "sS": 0},
                    {"uuid": 142, "cN": "第141章 我这一身衣服真的很奇怪吗？", "id": "32665219220285543", "uT": "2个月前", "cnt": 1061,
                     "fS": 1, "sS": 0},
                    {"uuid": 143, "cN": "第142章 人家还是一个纯洁的女孩纸", "id": "32665238015082610", "uT": "2个月前", "cnt": 1070,
                     "fS": 1, "sS": 0},
                    {"uuid": 144, "cN": "第143章 落毛的凤凰不如鸡", "id": "32689493832483450", "uT": "2个月前", "cnt": 1043, "fS": 1,
                     "sS": 0},
                    {"uuid": 145, "cN": "第144章 滚开的白开水", "id": "32689510753382993", "uT": "2个月前", "cnt": 1121, "fS": 1,
                     "sS": 0},
                    {"uuid": 146, "cN": "第145章 没有人可以在伤了他裴烨的人之后还能全身而退", "id": "32689528186705960", "uT": "2个月前",
                     "cnt": 1065, "fS": 1, "sS": 0},
                    {"uuid": 147, "cN": "第146章 苍蝇不叮无缝的蛋", "id": "32722124329535686", "uT": "1个月前", "cnt": 1019, "fS": 1,
                     "sS": 0},
                    {"uuid": 148, "cN": "第147章 早晚一天会查出真相", "id": "32722147931783158", "uT": "1个月前", "cnt": 1034,
                     "fS": 1, "sS": 0},
                    {"uuid": 149, "cN": "第148章 很快，你就会知道了", "id": "32722192755667777", "uT": "1个月前", "cnt": 1041,
                     "fS": 1, "sS": 0},
                    {"uuid": 150, "cN": "第149章 等我命令", "id": "32743206955356969", "uT": "1个月前", "cnt": 1119, "fS": 1,
                     "sS": 0},
                    {"uuid": 151, "cN": "第150章 你不是已经死了吗？", "id": "32743217972066709", "uT": "1个月前", "cnt": 1067,
                     "fS": 1, "sS": 0},
                    {"uuid": 152, "cN": "第151章 无福消受", "id": "32743233282376342", "uT": "1个月前", "cnt": 1140, "fS": 1,
                     "sS": 0},
                    {"uuid": 153, "cN": "第152章 肩不能挑、手不能提的大家闺秀", "id": "32757847965881113", "uT": "1个月前", "cnt": 1061,
                     "fS": 1, "sS": 0},
                    {"uuid": 154, "cN": "第153章 我的忍耐是有限度的", "id": "32757861388700060", "uT": "1个月前", "cnt": 1032,
                     "fS": 1, "sS": 0},
                    {"uuid": 155, "cN": "第154章 裴烨的脸一下子黑如锅底", "id": "32757911847812065", "uT": "1个月前", "cnt": 1031,
                     "fS": 1, "sS": 0},
                    {"uuid": 156, "cN": "第155章 被人偷窥的感觉", "id": "32782327946219186", "uT": "1个月前", "cnt": 1043, "fS": 1,
                     "sS": 0}, {"uuid": 157, "cN": "第156章 身高不是距离，年龄不是问题，我不在乎！", "id": "32782340832015028", "uT": "1个月前",
                                "cnt": 1060, "fS": 1, "sS": 0},
                    {"uuid": 158, "cN": "第157章 裴烨他已经订婚了", "id": "32782406586951527", "uT": "1个月前", "cnt": 1068, "fS": 1,
                     "sS": 0},
                    {"uuid": 159, "cN": "第158章 踏破铁鞋无觅处", "id": "32811499623182700", "uT": "1个月前", "cnt": 1064, "fS": 1,
                     "sS": 0},
                    {"uuid": 160, "cN": "第159章 那是我们未来的少夫人", "id": "32811517089907801", "uT": "1个月前", "cnt": 1042,
                     "fS": 1, "sS": 0},
                    {"uuid": 161, "cN": "第160章 你中枪了", "id": "32811529153908119", "uT": "1个月前", "cnt": 1022, "fS": 1,
                     "sS": 0},
                    {"uuid": 162, "cN": "第161章 他这次完了", "id": "32811546351215653", "uT": "1个月前", "cnt": 1027, "fS": 1,
                     "sS": 0},
                    {"uuid": 163, "cN": "第162章 重色轻友", "id": "32811584457234637", "uT": "1个月前", "cnt": 1032, "fS": 1,
                     "sS": 0},
                    {"uuid": 164, "cN": "第163章 都是一些庸医", "id": "32834859945144697", "uT": "1个月前", "cnt": 1071, "fS": 1,
                     "sS": 0},
                    {"uuid": 165, "cN": "第164章 芊芊你若是想看，就多看一会儿！", "id": "32834877394853998", "uT": "1个月前", "cnt": 1004,
                     "fS": 1, "sS": 0},
                    {"uuid": 166, "cN": "第165章 要静心、戒躁", "id": "32834889225684346", "uT": "1个月前", "cnt": 1016, "fS": 1,
                     "sS": 0},
                    {"uuid": 167, "cN": "第166章 能不动手……咱别动手，这样伤感情", "id": "32834914980850038", "uT": "1个月前", "cnt": 1055,
                     "fS": 1, "sS": 0},
                    {"uuid": 168, "cN": "第167章 睁眼说瞎话", "id": "32834946390589962", "uT": "1个月前", "cnt": 1035, "fS": 1,
                     "sS": 0},
                    {"uuid": 169, "cN": "第168章 军方唯一的女上将", "id": "32857200226750718", "uT": "1个月前", "cnt": 1077, "fS": 1,
                     "sS": 0},
                    {"uuid": 170, "cN": "第169章 凭实力单身", "id": "32857216591209628", "uT": "1个月前", "cnt": 1030, "fS": 1,
                     "sS": 0},
                    {"uuid": 171, "cN": "第170章 我亲爱的芊芊", "id": "32857254982920134", "uT": "1个月前", "cnt": 1039, "fS": 1,
                     "sS": 0},
                    {"uuid": 172, "cN": "第171章 一个好消息", "id": "32857280235314285", "uT": "1个月前", "cnt": 1014, "fS": 1,
                     "sS": 0},
                    {"uuid": 173, "cN": "第172章 一定是因为他那方面有问题", "id": "32857329093687468", "uT": "1个月前", "cnt": 1046,
                     "fS": 1, "sS": 0},
                    {"uuid": 174, "cN": "第173章 越来越名不符实了", "id": "32881331227976634", "uT": "1个月前", "cnt": 1289, "fS": 1,
                     "sS": 0},
                    {"uuid": 175, "cN": "第174章 宁可错杀三千也不放过一人", "id": "32881344654210750", "uT": "1个月前", "cnt": 1132,
                     "fS": 1, "sS": 0},
                    {"uuid": 176, "cN": "第175章 我也照样能再杀你一次", "id": "32881354587067769", "uT": "1个月前", "cnt": 1049,
                     "fS": 1, "sS": 0},
                    {"uuid": 177, "cN": "第176章 求姻缘还是……升职发财", "id": "32881376614047857", "uT": "1个月前", "cnt": 1029,
                     "fS": 1, "sS": 0},
                    {"uuid": 178, "cN": "第177章 跟他抢未婚妻，门都没有！", "id": "32881422755455709", "uT": "1个月前", "cnt": 1137,
                     "fS": 1, "sS": 0},
                    {"uuid": 179, "cN": "第178章 你是什么人？", "id": "32897273063958036", "uT": "1个月前", "cnt": 1114, "fS": 1,
                     "sS": 0},
                    {"uuid": 180, "cN": "第179章 你们夫人今年六十多岁了吧，他一个刚二十出头的人会非礼她？", "id": "32897299653592623", "uT": "1个月前",
                     "cnt": 1055, "fS": 1, "sS": 0},
                    {"uuid": 181, "cN": "第180章 你是选她，还是选我？", "id": "32897340173762533", "uT": "1个月前", "cnt": 1035,
                     "fS": 1, "sS": 0},
                    {"uuid": 182, "cN": "第181章 我也不是这么不通情达理的人", "id": "32897362728262032", "uT": "1个月前", "cnt": 1039,
                     "fS": 1, "sS": 0},
                    {"uuid": 183, "cN": "第182章 傅芊芊吃醋了", "id": "32897419104029100", "uT": "1个月前", "cnt": 1095, "fS": 1,
                     "sS": 0},
                    {"uuid": 184, "cN": "第183章 你跟奶奶的孙咋长得好像", "id": "32927085789817506", "uT": "1个月前", "cnt": 1049,
                     "fS": 1, "sS": 0},
                    {"uuid": 185, "cN": "第184章 人面兽心", "id": "32927097585290782", "uT": "1个月前", "cnt": 1041, "fS": 1,
                     "sS": 0},
                    {"uuid": 186, "cN": "第185章 可能会狠不下心", "id": "32927217057608600", "uT": "1个月前", "cnt": 1085, "fS": 1,
                     "sS": 0},
                    {"uuid": 187, "cN": "第186章 可傅芊芊是怎么知道的这么清楚？", "id": "32927268878870006", "uT": "1个月前", "cnt": 1011,
                     "fS": 1, "sS": 0},
                    {"uuid": 188, "cN": "第187章 能等到他的芊芊为他吃醋，真是太不容易了", "id": "32927301622325786", "uT": "1个月前",
                     "cnt": 1062, "fS": 1, "sS": 0},
                    {"uuid": 189, "cN": "第188章 你们……呃，继续！", "id": "32951111310579285", "uT": "1个月前", "cnt": 1050,
                     "fS": 1, "sS": 0},
                    {"uuid": 190, "cN": "第189章 太得寸进尺了", "id": "32951126344370517", "uT": "1个月前", "cnt": 1092, "fS": 1,
                     "sS": 0},
                    {"uuid": 191, "cN": "第190章 队……队长！", "id": "32951143256986264", "uT": "1个月前", "cnt": 1114, "fS": 1,
                     "sS": 0},
                    {"uuid": 192, "cN": "第191章 已经不只是单纯的喜欢了", "id": "32951153185783855", "uT": "1个月前", "cnt": 1097,
                     "fS": 1, "sS": 0},
                    {"uuid": 193, "cN": "第192章 已经慢慢的失控", "id": "32951185104631767", "uT": "1个月前", "cnt": 1058, "fS": 1,
                     "sS": 0},
                    {"uuid": 194, "cN": "第193章 字并不如其人", "id": "32973311165395500", "uT": "1个月前", "cnt": 1028, "fS": 1,
                     "sS": 0},
                    {"uuid": 195, "cN": "第194章 生前的功德无量", "id": "32973351990893309", "uT": "1个月前", "cnt": 1076, "fS": 1,
                     "sS": 0},
                    {"uuid": 196, "cN": "第195章 什么人胆敢在她的车上装炸弹？", "id": "32973377494970048", "uT": "1个月前", "cnt": 1198,
                     "fS": 1, "sS": 0},
                    {"uuid": 197, "cN": "第196章 殷勤过头了", "id": "32973389572009687", "uT": "1个月前", "cnt": 1054, "fS": 1,
                     "sS": 0},
                    {"uuid": 198, "cN": "第197章 联谊", "id": "32973450763023089", "uT": "1个月前", "cnt": 1034, "fS": 1,
                     "sS": 0},
                    {"uuid": 199, "cN": "第198章 当她死的吗？", "id": "32997068788331115", "uT": "1个月前", "cnt": 1018, "fS": 1,
                     "sS": 0},
                    {"uuid": 200, "cN": "第199章 这是有戏啊", "id": "32997080869451629", "uT": "1个月前", "cnt": 1088, "fS": 1,
                     "sS": 0},
                    {"uuid": 201, "cN": "第200章 你是想给我找男人", "id": "32997090802762238", "uT": "1个月前", "cnt": 1068, "fS": 1,
                     "sS": 0},
                    {"uuid": 202, "cN": "第201章 射击场", "id": "32997104762357991", "uT": "1个月前", "cnt": 1104, "fS": 1,
                     "sS": 0},
                    {"uuid": 203, "cN": "第202章 你太弱了", "id": "32997129997840321", "uT": "1个月前", "cnt": 1061, "fS": 1,
                     "sS": 0},
                    {"uuid": 204, "cN": "第203章 好想嫁", "id": "33019655218882908", "uT": "1个月前", "cnt": 1109, "fS": 1,
                     "sS": 0},
                    {"uuid": 205, "cN": "第204章 你一定还会再来的！", "id": "33019666228266153", "uT": "1个月前", "cnt": 1046,
                     "fS": 1, "sS": 0},
                    {"uuid": 206, "cN": "第205章 自投罗网", "id": "33019677234454763", "uT": "1个月前", "cnt": 1100, "fS": 1,
                     "sS": 0},
                    {"uuid": 207, "cN": "第206章 大约是医生他们搞错了", "id": "33019691195507997", "uT": "1个月前", "cnt": 1014,
                     "fS": 1, "sS": 0},
                    {"uuid": 208, "cN": "第207章 定情信物", "id": "33019701934637669", "uT": "1个月前", "cnt": 1049, "fS": 1,
                     "sS": 0},
                    {"uuid": 209, "cN": "第208章 想想都兴奋", "id": "33019712925597472", "uT": "1个月前", "cnt": 1068, "fS": 1,
                     "sS": 0},
                    {"uuid": 210, "cN": "第209章 裴烨的未婚妻", "id": "33019743263619597", "uT": "1个月前", "cnt": 1041, "fS": 1,
                     "sS": 0},
                    {"uuid": 211, "cN": "第210章 忍得好辛苦", "id": "33042661737206608", "uT": "1个月前", "cnt": 1069, "fS": 1,
                     "sS": 0},
                    {"uuid": 212, "cN": "第211章 你的未婚妻是在我手上", "id": "33042684036368768", "uT": "1个月前", "cnt": 1068,
                     "fS": 1, "sS": 0},
                    {"uuid": 213, "cN": "第212章 都是不长眼的东西", "id": "33042748987161590", "uT": "1个月前", "cnt": 1077, "fS": 1,
                     "sS": 0},
                    {"uuid": 214, "cN": "第213章 手不干净，那就废了你的手！", "id": "12309402904992415", "uT": "1个月前", "cnt": 1045,
                     "fS": 1, "sS": 0},
                    {"uuid": 215, "cN": "第214章 裴烨会真的不在乎他那个未婚妻的性命", "id": "33066044081663005", "uT": "1个月前", "cnt": 1024,
                     "fS": 1, "sS": 0},
                    {"uuid": 216, "cN": "第215章 分舵那边联系不上", "id": "33066056448144991", "uT": "1个月前", "cnt": 1043, "fS": 1,
                     "sS": 0},
                    {"uuid": 217, "cN": "第216章 难道你们要弑主吗？", "id": "33066143679662890", "uT": "1个月前", "cnt": 1202,
                     "fS": 1, "sS": 0},
                    {"uuid": 218, "cN": "第217章 我下午放学后有事", "id": "33066165139292351", "uT": "1个月前", "cnt": 1060, "fS": 1,
                     "sS": 0},
                    {"uuid": 219, "cN": "第218章 近朱者赤、近墨者黑", "id": "33066217236719061", "uT": "1个月前", "cnt": 1103,
                     "fS": 1, "sS": 0},
                    {"uuid": 220, "cN": "第219章 一点儿也不懂得谦虚为何物", "id": "33089714450252116", "uT": "1个月前", "cnt": 1035,
                     "fS": 1, "sS": 0},
                    {"uuid": 221, "cN": "第220章 大外甥！", "id": "33089734584848220", "uT": "1个月前", "cnt": 1119, "fS": 1,
                     "sS": 0},
                    {"uuid": 222, "cN": "第221章 我想转学！", "id": "33089749350036349", "uT": "1个月前", "cnt": 1018, "fS": 1,
                     "sS": 0},
                    {"uuid": 223, "cN": "第222章 我应当叫你明日舵主呢？还是卢因？", "id": "33089760642074356", "uT": "1个月前", "cnt": 1058,
                     "fS": 1, "sS": 0},
                    {"uuid": 224, "cN": "第223章 聪明反被聪明误", "id": "33089783461351222", "uT": "1个月前", "cnt": 1060, "fS": 1,
                     "sS": 0},
                    {"uuid": 225, "cN": "第224章 怎么不继续说了？", "id": "33111505237556476", "uT": "1个月前", "cnt": 1022, "fS": 1,
                     "sS": 0},
                    {"uuid": 226, "cN": "第225章 定位", "id": "33111521344578256", "uT": "1个月前", "cnt": 1041, "fS": 1,
                     "sS": 0},
                    {"uuid": 227, "cN": "第226章 说是要求，其实就是为难", "id": "33111538525491253", "uT": "1个月前", "cnt": 1037,
                     "fS": 1, "sS": 0},
                    {"uuid": 228, "cN": "第227章 他得赶紧通知嫂子", "id": "33111551678183425", "uT": "1个月前", "cnt": 1033, "fS": 1,
                     "sS": 0},
                    {"uuid": 229, "cN": "第228章 能不能先穿上衣服", "id": "33111587920998658", "uT": "1个月前", "cnt": 1052, "fS": 1,
                     "sS": 0},
                    {"uuid": 230, "cN": "第229章 裴烨他没有逼我", "id": "33136192982283475", "uT": "1个月前", "cnt": 1068, "fS": 1,
                     "sS": 0},
                    {"uuid": 231, "cN": "第230章 终于要再见面了", "id": "33136215532776820", "uT": "1个月前", "cnt": 1011, "fS": 1,
                     "sS": 0},
                    {"uuid": 232, "cN": "第231章 提出的要求太无耻", "id": "33136238335328754", "uT": "1个月前", "cnt": 1040, "fS": 1,
                     "sS": 0},
                    {"uuid": 233, "cN": "第232章 一脚将面前的包厢门踢开", "id": "33136294987995858", "uT": "1个月前", "cnt": 1021,
                     "fS": 1, "sS": 0},
                    {"uuid": 234, "cN": "第233章 你不记得我了吗？", "id": "33136308420099330", "uT": "1个月前", "cnt": 1034, "fS": 1,
                     "sS": 0},
                    {"uuid": 235, "cN": "第234章 为什么总有人跟他抢老婆？", "id": "33136334434815984", "uT": "1个月前", "cnt": 1050,
                     "fS": 1, "sS": 0},
                    {"uuid": 236, "cN": "第235章 你现在就杀了她吧", "id": "33157406906036187", "uT": "1个月前", "cnt": 1023, "fS": 1,
                     "sS": 0},
                    {"uuid": 237, "cN": "第236章 老太婆", "id": "33157426503533179", "uT": "1个月前", "cnt": 1130, "fS": 1,
                     "sS": 0},
                    {"uuid": 238, "cN": "第237章 亲爱的", "id": "33157439915402920", "uT": "1个月前", "cnt": 1029, "fS": 1,
                     "sS": 0},
                    {"uuid": 239, "cN": "第238章 梦里记得想我", "id": "33157452801849778", "uT": "1个月前", "cnt": 1083, "fS": 1,
                     "sS": 0},
                    {"uuid": 240, "cN": "第239章 贪婪", "id": "33157471594342939", "uT": "1个月前", "cnt": 1076, "fS": 1,
                     "sS": 0},
                    {"uuid": 241, "cN": "第240章 真正纵火凶手", "id": "33157503003915268", "uT": "1个月前", "cnt": 1059, "fS": 1,
                     "sS": 0},
                    {"uuid": 242, "cN": "第241章 我等你的好消息", "id": "33175612472244345", "uT": "1个月前", "cnt": 1101, "fS": 1,
                     "sS": 0},
                    {"uuid": 243, "cN": "第242章 去裴家拜访", "id": "33175634218667201", "uT": "1个月前", "cnt": 1028, "fS": 1,
                     "sS": 0},
                    {"uuid": 244, "cN": "第243章 老婆是我的", "id": "33175649759268397", "uT": "1个月前", "cnt": 1098, "fS": 1,
                     "sS": 0},
                    {"uuid": 245, "cN": "第244章 孙媳妇好凶", "id": "33175659709657756", "uT": "1个月前", "cnt": 1021, "fS": 1,
                     "sS": 0},
                    {"uuid": 246, "cN": "第245章 顺手将房门关上并反锁", "id": "33175687899564752", "uT": "1个月前", "cnt": 1051,
                     "fS": 1, "sS": 0},
                    {"uuid": 247, "cN": "第246章 裴烨的房间里摆着女孩的照片？", "id": "33199449538658572", "uT": "1个月前", "cnt": 1106,
                     "fS": 1, "sS": 0},
                    {"uuid": 248, "cN": "第247章 被压？", "id": "33199469673433485", "uT": "1个月前", "cnt": 1125, "fS": 1,
                     "sS": 0},
                    {"uuid": 249, "cN": "第248章 找个地方谈情说爱", "id": "33199480663453532", "uT": "1个月前", "cnt": 1027, "fS": 1,
                     "sS": 0},
                    {"uuid": 250, "cN": "第249章 把那张照片拍下来", "id": "33199499472546360", "uT": "1个月前", "cnt": 1014, "fS": 1,
                     "sS": 0},
                    {"uuid": 251, "cN": "第250章 她说不能开就不能开？", "id": "33199520659791456", "uT": "1个月前", "cnt": 1140,
                     "fS": 1, "sS": 0},
                    {"uuid": 252, "cN": "第251章 芊芊怎么说也是你未来的媳妇儿，你下手也太狠了", "id": "33199541616635413", "uT": "1个月前",
                     "cnt": 1058, "fS": 1, "sS": 0},
                    {"uuid": 253, "cN": "第252章 能得到芊芊你的赞赏，我很荣幸。", "id": "33227923292839192", "uT": "1个月前", "cnt": 1049,
                     "fS": 1, "sS": 0},
                    {"uuid": 254, "cN": "第253章 夫人硬要开，我拦不住！", "id": "33227936158027766", "uT": "1个月前", "cnt": 1019,
                     "fS": 1, "sS": 0},
                    {"uuid": 255, "cN": "第254章 那驾驶座的人是谁？", "id": "33227950407249908", "uT": "1个月前", "cnt": 1326,
                     "fS": 1, "sS": 0},
                    {"uuid": 256, "cN": "第255章 不是找妈吗？", "id": "33227963293209885", "uT": "1个月前", "cnt": 1049, "fS": 1,
                     "sS": 0},
                    {"uuid": 257, "cN": "第256章 车毁人亡", "id": "33228098561370067", "uT": "1个月前", "cnt": 1047, "fS": 1,
                     "sS": 0},
                    {"uuid": 258, "cN": "第257章 我不跳", "id": "33251246551777252", "uT": "1个月前", "cnt": 1055, "fS": 1,
                     "sS": 0},
                    {"uuid": 259, "cN": "第258章 掉下悬崖", "id": "33251265104735174", "uT": "1个月前", "cnt": 1027, "fS": 1,
                     "sS": 0},
                    {"uuid": 260, "cN": "第259章 一定不会有事的", "id": "33251279858178818", "uT": "1个月前", "cnt": 1046, "fS": 1,
                     "sS": 0},
                    {"uuid": 261, "cN": "第260章 生还的可能性很小", "id": "33251327359793353", "uT": "1个月前", "cnt": 1080, "fS": 1,
                     "sS": 0},
                    {"uuid": 262, "cN": "第261章 我没事你很失望？", "id": "33274958545784743", "uT": "1个月前", "cnt": 1035, "fS": 1,
                     "sS": 0},
                    {"uuid": 263, "cN": "第262章 不放！", "id": "33274976801246530", "uT": "1个月前", "cnt": 1041, "fS": 1,
                     "sS": 0},
                    {"uuid": 264, "cN": "第263章 他的芊芊没事，真是太好了。", "id": "33274988076642343", "uT": "1个月前", "cnt": 1054,
                     "fS": 1, "sS": 0},
                    {"uuid": 265, "cN": "第264章 为什么？", "id": "33275005526487691", "uT": "1个月前", "cnt": 1079, "fS": 1,
                     "sS": 0},
                    {"uuid": 266, "cN": "第265章 你不是自私，你只是更在乎我！", "id": "33297617454341207", "uT": "1个月前", "cnt": 1193,
                     "fS": 1, "sS": 0},
                    {"uuid": 267, "cN": "第266章 队长，是你吗？", "id": "33297635424210453", "uT": "1个月前", "cnt": 1063, "fS": 1,
                     "sS": 0},
                    {"uuid": 268, "cN": "第267章 要不要告诉他她真实的身份", "id": "33297691819569446", "uT": "1个月前", "cnt": 1102,
                     "fS": 1, "sS": 0},
                    {"uuid": 269, "cN": "第268章 是我先身败名裂，还是你们先挫骨扬灰！", "id": "33297709267805145", "uT": "1个月前",
                     "cnt": 1022, "fS": 1, "sS": 0},
                    {"uuid": 270, "cN": "第269章 芊芊，是我。", "id": "33322176077918232", "uT": "1个月前", "cnt": 1008, "fS": 1,
                     "sS": 0},
                    {"uuid": 271, "cN": "第270章 是什么人在暗中偷窥她", "id": "33322189232166647", "uT": "1个月前", "cnt": 1042,
                     "fS": 1, "sS": 0},
                    {"uuid": 272, "cN": "第271章 就说你会后悔的！", "id": "33322198074605420", "uT": "1个月前", "cnt": 1020, "fS": 1,
                     "sS": 0},
                    {"uuid": 273, "cN": "第272章 老大不小了", "id": "33322221984416009", "uT": "1个月前", "cnt": 1192, "fS": 1,
                     "sS": 0},
                    {"uuid": 274, "cN": "第273章 原来，白蔻是等在这里呢！", "id": "33348105335132907", "uT": "1个月前", "cnt": 1066,
                     "fS": 1, "sS": 0},
                    {"uuid": 275, "cN": "第274章 你总不可能当着我哥的面跟我嫂子告白过吧？", "id": "33348120897252849", "uT": "1个月前",
                     "cnt": 1038, "fS": 1, "sS": 0},
                    {"uuid": 276, "cN": "第275章 这个乌鸦嘴", "id": "33348133796071812", "uT": "1个月前", "cnt": 1027, "fS": 1,
                     "sS": 0},
                    {"uuid": 277, "cN": "第276章 那个女人是谁？", "id": "33348145040005901", "uT": "1个月前", "cnt": 1126, "fS": 1,
                     "sS": 0},
                    {"uuid": 278, "cN": "第277章 一个是新欢，一个是旧爱", "id": "33367090696292695", "uT": "1个月前", "cnt": 1047,
                     "fS": 1, "sS": 0},
                    {"uuid": 279, "cN": "第278章 是问心无愧还是死不要脸", "id": "33367101955456686", "uT": "1个月前", "cnt": 1018,
                     "fS": 1, "sS": 0},
                    {"uuid": 280, "cN": "第279章 我可以为了傅小姐改掉这个习惯", "id": "33367112693992719", "uT": "1个月前", "cnt": 1085,
                     "fS": 1, "sS": 0},
                    {"uuid": 281, "cN": "第280章 男邻居", "id": "33367177677815863", "uT": "1个月前", "cnt": 1034, "fS": 1,
                     "sS": 0},
                    {"uuid": 282, "cN": "第281章 两个怎么会同时不见了？", "id": "33384038918672404", "uT": "1个月前", "cnt": 1038,
                     "fS": 1, "sS": 0},
                    {"uuid": 283, "cN": "第282章 进错洗手间了", "id": "33384061454169202", "uT": "1个月前", "cnt": 1077, "fS": 1,
                     "sS": 0},
                    {"uuid": 284, "cN": "第283章 你的夺命勾魂锁", "id": "33384076223764293", "uT": "1个月前", "cnt": 1017, "fS": 1,
                     "sS": 0},
                    {"uuid": 285, "cN": "第284章 只有紫车能做得到", "id": "33384089630096405", "uT": "1个月前", "cnt": 1096, "fS": 1,
                     "sS": 0},
                    {"uuid": 286, "cN": "第285章 一个黑洞洞的枪口对准了她的头", "id": "33384119177043541", "uT": "1个月前", "cnt": 1044,
                     "fS": 1, "sS": 0},
                    {"uuid": 287, "cN": "第286章 裴先生，你当真要妨碍军方执法？", "id": "33414648595707896", "uT": "30天前", "cnt": 1019,
                     "fS": 1, "sS": 0},
                    {"uuid": 288, "cN": "第287章 除非我死！", "id": "33414660424576258", "uT": "30天前", "cnt": 1168, "fS": 1,
                     "sS": 0},
                    {"uuid": 289, "cN": "第288章 暗器上有毒", "id": "33414675709660688", "uT": "30天前", "cnt": 1044, "fS": 1,
                     "sS": 0},
                    {"uuid": 290, "cN": "第289章 如果掉下去，不死也残", "id": "33414689139409697", "uT": "30天前", "cnt": 1081,
                     "fS": 1, "sS": 0},
                    {"uuid": 291, "cN": "第290章 救一个人需要理由吗？", "id": "33414720548366247", "uT": "30天前", "cnt": 1167,
                     "fS": 1, "sS": 0},
                    {"uuid": 292, "cN": "第291章 你是谁？跟裴烨是什么关系？", "id": "33436613881339546", "uT": "29天前", "cnt": 1155,
                     "fS": 1, "sS": 0},
                    {"uuid": 293, "cN": "第292章 傅小姐可以不要再吃醋了吗？", "id": "33436622992201443", "uT": "29天前", "cnt": 1179,
                     "fS": 1, "sS": 0},
                    {"uuid": 294, "cN": "第293章 你说我……吃醋？", "id": "33436634812328716", "uT": "29天前", "cnt": 1103, "fS": 1,
                     "sS": 0},
                    {"uuid": 295, "cN": "第294章 那是紫车的绝技。", "id": "33436650097822443", "uT": "29天前", "cnt": 1076, "fS": 1,
                     "sS": 0},
                    {"uuid": 296, "cN": "第295章 离这么近，还发什么短信？", "id": "33436673194145298", "uT": "29天前", "cnt": 1086,
                     "fS": 1, "sS": 0},
                    {"uuid": 297, "cN": "第296章 芊芊，你这样说，会让我兴奋的。", "id": "33458794138551991", "uT": "28天前", "cnt": 1319,
                     "fS": 1, "sS": 0},
                    {"uuid": 298, "cN": "第297章 你还凶我，你不爱我了！", "id": "33458809709605707", "uT": "28天前", "cnt": 1041,
                     "fS": 1, "sS": 0},
                    {"uuid": 299, "cN": "第298章 正好帮我做一件事", "id": "33458826890596593", "uT": "28天前", "cnt": 1059, "fS": 1,
                     "sS": 0},
                    {"uuid": 300, "cN": "第299章 就等你发话了", "id": "33458838971082340", "uT": "28天前", "cnt": 1034, "fS": 1,
                     "sS": 0},
                    {"uuid": 301, "cN": "第300章 将枪挪了方向，朝裴烨的方向瞄准。", "id": "33458863669045695", "uT": "28天前", "cnt": 1035,
                     "fS": 1, "sS": 0},
                    {"uuid": 302, "cN": "第301章 就算为恶，只一次也是恶", "id": "33482540742086525", "uT": "27天前", "cnt": 1022,
                     "fS": 1, "sS": 0},
                    {"uuid": 303, "cN": "第302章 这种事，还是让男人来！", "id": "33482554730940714", "uT": "27天前", "cnt": 1087,
                     "fS": 1, "sS": 0},
                    {"uuid": 304, "cN": "第303章 你做了……什么……", "id": "33482566794883802", "uT": "27天前", "cnt": 1053,
                     "fS": 1, "sS": 0},
                    {"uuid": 305, "cN": "第304章 代价？", "id": "33482582906976640", "uT": "27天前", "cnt": 1019, "fS": 1,
                     "sS": 0},
                    {"uuid": 306, "cN": "第305章 对不起", "id": "33482638746328328", "uT": "27天前", "cnt": 1095, "fS": 1,
                     "sS": 0},
                    {"uuid": 307, "cN": "第306章 年轻人，要有点耐性！", "id": "33507415873593322", "uT": "26天前", "cnt": 1076,
                     "fS": 1, "sS": 0},
                    {"uuid": 308, "cN": "第307章 此人施术后的三十秒至四十八小时之内，头发会呈全白状态", "id": "33507429272265254", "uT": "26天前",
                     "cnt": 1058, "fS": 1, "sS": 0},
                    {"uuid": 309, "cN": "第308章 真正的队长只有一个人", "id": "33507440555320443", "uT": "26天前", "cnt": 1060,
                     "fS": 1, "sS": 0},
                    {"uuid": 310, "cN": "第309章 明明他才是队长最信任的人", "id": "33507456655256022", "uT": "26天前", "cnt": 1270,
                     "fS": 1, "sS": 0},
                    {"uuid": 311, "cN": "第310章 不能用普通的方式毁掉", "id": "33507468735995250", "uT": "26天前", "cnt": 1102,
                     "fS": 1, "sS": 0},
                    {"uuid": 312, "cN": "第311章 你很闲吗？", "id": "33507479750832525", "uT": "26天前", "cnt": 1052, "fS": 1,
                     "sS": 0},
                    {"uuid": 313, "cN": "第312章 现在立刻撤退！", "id": "33507503358683681", "uT": "26天前", "cnt": 1088, "fS": 1,
                     "sS": 0},
                    {"uuid": 314, "cN": "第313章 那就是你们所有的手和脚全部都碰了！", "id": "33530035026568139", "uT": "25天前", "cnt": 1097,
                     "fS": 1, "sS": 0},
                    {"uuid": 315, "cN": "第314章 你赔我钱吧！", "id": "33530047406801595", "uT": "25天前", "cnt": 1107, "fS": 1,
                     "sS": 0},
                    {"uuid": 316, "cN": "第315章 你们店里今天有什么招牌菜？", "id": "33530060261220378", "uT": "25天前", "cnt": 1235,
                     "fS": 1, "sS": 0},
                    {"uuid": 317, "cN": "第316章 傅芊芊解扣子的动作并没停", "id": "33530089262181132", "uT": "25天前", "cnt": 1079,
                     "fS": 1, "sS": 0},
                    {"uuid": 318, "cN": "第317章 你傻啊！", "id": "33530115052737639", "uT": "25天前", "cnt": 1057, "fS": 1,
                     "sS": 0},
                    {"uuid": 319, "cN": "第318章 不知当说不当说", "id": "33553053650835379", "uT": "24天前", "cnt": 1093, "fS": 1,
                     "sS": 0},
                    {"uuid": 320, "cN": "第319章 死机器人，居然撩他老婆！", "id": "33553063566862755", "uT": "24天前", "cnt": 1082,
                     "fS": 1, "sS": 0},
                    {"uuid": 321, "cN": "第320章 一把握住傅芊芊的手，将她拉进了怀里。", "id": "33553081035416614", "uT": "24天前",
                     "cnt": 1058, "fS": 1, "sS": 0},
                    {"uuid": 322, "cN": "第321章 你喜欢吃什么菜？", "id": "33553108687121984", "uT": "24天前", "cnt": 1053, "fS": 1,
                     "sS": 0},
                    {"uuid": 323, "cN": "第322章 驯妻的技术", "id": "33553146541089787", "uT": "24天前", "cnt": 1259, "fS": 1,
                     "sS": 0},
                    {"uuid": 324, "cN": "第323章 门外出现了一名陌生的漂亮女孩", "id": "33576261507299482", "uT": "23天前", "cnt": 1080,
                     "fS": 1, "sS": 0},
                    {"uuid": 325, "cN": "第324章 现在我可以请你帮忙了吗？", "id": "33576275181777040", "uT": "23天前", "cnt": 1055,
                     "fS": 1, "sS": 0},
                    {"uuid": 326, "cN": "第325章 照片上出现在大火源头处的白蔻", "id": "33576291843695782", "uT": "23天前", "cnt": 1081,
                     "fS": 1, "sS": 0},
                    {"uuid": 327, "cN": "第326章 只许成功、不许失败", "id": "33576306592817589", "uT": "23天前", "cnt": 1115,
                     "fS": 1, "sS": 0},
                    {"uuid": 328, "cN": "第327章 拆房子吗？", "id": "33576340419942937", "uT": "23天前", "cnt": 1083, "fS": 1,
                     "sS": 0},
                    {"uuid": 329, "cN": "第328章 快过来试毒！", "id": "33599070741242548", "uT": "22天前", "cnt": 1084, "fS": 1,
                     "sS": 0},
                    {"uuid": 330, "cN": "第329章 这什么菜，怎么这么难吃！", "id": "33599080408316727", "uT": "22天前", "cnt": 1104,
                     "fS": 1, "sS": 0},
                    {"uuid": 331, "cN": "第330章 因为你刚刚的话惹我不高兴了！", "id": "33599090610281034", "uT": "22天前", "cnt": 1070,
                     "fS": 1, "sS": 0},
                    {"uuid": 332, "cN": "第331章 你都知道什么？", "id": "33599138107980624", "uT": "22天前", "cnt": 1066, "fS": 1,
                     "sS": 0},
                    {"uuid": 333, "cN": "第332章 我有一种上了贼船的感觉？", "id": "33622687433662225", "uT": "21天前", "cnt": 1090,
                     "fS": 1, "sS": 0},
                    {"uuid": 334, "cN": "第333章 你们是什么人？", "id": "33622697340448994", "uT": "21天前", "cnt": 1051, "fS": 1,
                     "sS": 0},
                    {"uuid": 335, "cN": "第334章 以我的身份应当足够帮你", "id": "33622710780101920", "uT": "21天前", "cnt": 1043,
                     "fS": 1, "sS": 0},
                    {"uuid": 336, "cN": "第335章 你的要求我答应你", "id": "33622781377767304", "uT": "21天前", "cnt": 1037, "fS": 1,
                     "sS": 0},
                    {"uuid": 337, "cN": "第336章 组织的秘密", "id": "33643859189817320", "uT": "20天前", "cnt": 1056, "fS": 1,
                     "sS": 0},
                    {"uuid": 338, "cN": "第337章 这位小姐……好像没见过！", "id": "33643868871561427", "uT": "20天前", "cnt": 1234,
                     "fS": 1, "sS": 0},
                    {"uuid": 339, "cN": "第338章 芊芊你拉我起来", "id": "33643878795046030", "uT": "20天前", "cnt": 1038, "fS": 1,
                     "sS": 0},
                    {"uuid": 340, "cN": "第339章 你能正经一点吗？", "id": "33643895952591819", "uT": "20天前", "cnt": 1060, "fS": 1,
                     "sS": 0},
                    {"uuid": 341, "cN": "第340章 老牛吃嫩草", "id": "33668638477682267", "uT": "19天前", "cnt": 1062, "fS": 1,
                     "sS": 0},
                    {"uuid": 342, "cN": "第341章 给少夫人找了个小白脸？", "id": "33668647856952112", "uT": "19天前", "cnt": 1086,
                     "fS": 1, "sS": 0},
                    {"uuid": 343, "cN": "第342章 最毒妇人心", "id": "33668666129712858", "uT": "19天前", "cnt": 1072, "fS": 1,
                     "sS": 0},
                    {"uuid": 344, "cN": "第343章 恼羞成怒了？", "id": "33689478726281514", "uT": "18天前", "cnt": 1108, "fS": 1,
                     "sS": 0},
                    {"uuid": 345, "cN": "第344章 借人", "id": "33689500740574743", "uT": "18天前", "cnt": 1104, "fS": 1,
                     "sS": 0},
                    {"uuid": 346, "cN": "第345章 眼睛里顿时腾起火焰", "id": "33689713345082852", "uT": "18天前", "cnt": 1080,
                     "fS": 1, "sS": 0}], "vS": 1, "wC": 285140}, {"vN": "第三卷  已婚", "cCnt": 83, "cs": [
                    {"uuid": 347, "cN": "第346章 越来越得寸进尺", "id": "33722507570162121", "uT": "17天前", "cnt": 2079, "fS": 1,
                     "sS": 0},
                    {"uuid": 348, "cN": "第347章 一个惊喜", "id": "33722521528740133", "uT": "17天前", "cnt": 2079, "fS": 1,
                     "sS": 0},
                    {"uuid": 349, "cN": "第348章 他喜欢的人是你", "id": "33722536277783731", "uT": "17天前", "cnt": 2038, "fS": 1,
                     "sS": 0},
                    {"uuid": 350, "cN": "第349章 我们打个赌", "id": "33722544885197069", "uT": "17天前", "cnt": 2256, "fS": 1,
                     "sS": 0}, {"uuid": 351, "cN": "第350章 明明是胜券在握的赌约，她怎么还会输呢？", "id": "33722553461157106", "uT": "17天前",
                                "cnt": 2091, "fS": 1, "sS": 0},
                    {"uuid": 352, "cN": "第351章 无法预知自己的未来", "id": "33722582989532237", "uT": "17天前", "cnt": 2026,
                     "fS": 1, "sS": 0},
                    {"uuid": 353, "cN": "第352章 隔壁的朋友，能不能帮个忙？", "id": "33722592924557989", "uT": "17天前", "cnt": 2078,
                     "fS": 1, "sS": 0},
                    {"uuid": 354, "cN": "第353章 会！", "id": "33722602320628003", "uT": "17天前", "cnt": 2117, "fS": 1,
                     "sS": 0},
                    {"uuid": 355, "cN": "第354章 想走？没那么容易！", "id": "33722617604059975", "uT": "17天前", "cnt": 2223,
                     "fS": 1, "sS": 0},
                    {"uuid": 356, "cN": "第355章 队长的驯夫技术简直了得", "id": "33722627001831655", "uT": "17天前", "cnt": 2129,
                     "fS": 1, "sS": 0},
                    {"uuid": 357, "cN": "第356章 万年老二", "id": "33722635338941281", "uT": "17天前", "cnt": 2170, "fS": 1,
                     "sS": 0},
                    {"uuid": 358, "cN": "第357章 第三次了", "id": "33722646599334225", "uT": "17天前", "cnt": 2070, "fS": 1,
                     "sS": 0},
                    {"uuid": 359, "cN": "第358章 活要见人、死要见尸！", "id": "33722654936395480", "uT": "17天前", "cnt": 2137,
                     "fS": 1, "sS": 0},
                    {"uuid": 360, "cN": "第359章 最高级通缉令", "id": "33722665391180603", "uT": "17天前", "cnt": 2044, "fS": 1,
                     "sS": 0},
                    {"uuid": 361, "cN": "第360章 难道还想要让我再重复一遍吗？", "id": "33722677220037546", "uT": "17天前", "cnt": 2057,
                     "fS": 1, "sS": 0},
                    {"uuid": 362, "cN": "第361章 指不上的", "id": "33722691163227345", "uT": "17天前", "cnt": 2058, "fS": 1,
                     "sS": 0},
                    {"uuid": 363, "cN": "第362章 这是心病", "id": "33722706465704056", "uT": "17天前", "cnt": 2015, "fS": 1,
                     "sS": 0},
                    {"uuid": 364, "cN": "第363章 我只想知道结果", "id": "33722720171077140", "uT": "17天前", "cnt": 2124, "fS": 1,
                     "sS": 0},
                    {"uuid": 365, "cN": "第364章 想做军人", "id": "33722750761093496", "uT": "17天前", "cnt": 2068, "fS": 1,
                     "sS": 0},
                    {"uuid": 366, "cN": "第365章 生存的唯一意义", "id": "33722772503016239", "uT": "17天前", "cnt": 2047, "fS": 1,
                     "sS": 0},
                    {"uuid": 367, "cN": "第366章 亲子鉴定报告", "id": "33722780811210796", "uT": "17天前", "cnt": 2068, "fS": 1,
                     "sS": 0},
                    {"uuid": 368, "cN": "第367章 裴烨应当已经着急了吧？", "id": "33722810072718293", "uT": "17天前", "cnt": 2081,
                     "fS": 1, "sS": 0},
                    {"uuid": 369, "cN": "第368章 傅芊芊第一顺位继承人", "id": "33722822975190794", "uT": "17天前", "cnt": 2038,
                     "fS": 1, "sS": 0},
                    {"uuid": 370, "cN": "第369章 我的心里就只有你一个女人", "id": "33722837454566825", "uT": "17天前", "cnt": 2037,
                     "fS": 1, "sS": 0},
                    {"uuid": 371, "cN": "第370章 没有少为她担心吧？", "id": "33722893024584634", "uT": "17天前", "cnt": 2059,
                     "fS": 1, "sS": 0},
                    {"uuid": 372, "cN": "第371章 随便挂人电话不礼貌", "id": "33739460066768605", "uT": "16天前", "cnt": 2053,
                     "fS": 1, "sS": 0},
                    {"uuid": 373, "cN": "第372章 一定要保重自己的身体", "id": "33739482869264479", "uT": "16天前", "cnt": 2130,
                     "fS": 1, "sS": 0},
                    {"uuid": 374, "cN": "第373章 验证身份", "id": "33739496557286372", "uT": "16天前", "cnt": 2049, "fS": 1,
                     "sS": 0},
                    {"uuid": 375, "cN": "第374章 婚姻状态：已婚", "id": "33739516443434093", "uT": "16天前", "cnt": 2075, "fS": 1,
                     "sS": 0},
                    {"uuid": 376, "cN": "第375章 我未婚夫", "id": "33763477524607944", "uT": "15天前", "cnt": 2022, "fS": 1,
                     "sS": 0},
                    {"uuid": 377, "cN": "第376章 是我，傅芊芊", "id": "33763496031699321", "uT": "15天前", "cnt": 2050, "fS": 1,
                     "sS": 0},
                    {"uuid": 378, "cN": "第377章 你……愿不愿意？", "id": "33763504624788911", "uT": "15天前", "cnt": 2157, "fS": 1,
                     "sS": 0},
                    {"uuid": 379, "cN": "第378章 嫂子，真的是你呀", "id": "33763522628659238", "uT": "15天前", "cnt": 2034, "fS": 1,
                     "sS": 0},
                    {"uuid": 380, "cN": "第379章 总裁还在开会", "id": "33788387273987877", "uT": "14天前", "cnt": 2019, "fS": 1,
                     "sS": 0},
                    {"uuid": 381, "cN": "第380章 我有第六感！", "id": "33788399056122346", "uT": "14天前", "cnt": 2050, "fS": 1,
                     "sS": 0},
                    {"uuid": 382, "cN": "第381章 我脸上有东西？", "id": "33788412210797254", "uT": "14天前", "cnt": 2052, "fS": 1,
                     "sS": 0},
                    {"uuid": 383, "cN": "第382章 亲爱的芊芊", "id": "33788437718149308", "uT": "14天前", "cnt": 2142, "fS": 1,
                     "sS": 0},
                    {"uuid": 384, "cN": "第383章 求婚戒指都买好了", "id": "33810964562833950", "uT": "13天前", "cnt": 2021, "fS": 1,
                     "sS": 0},
                    {"uuid": 385, "cN": "第384章 越来越小气", "id": "33810973958835382", "uT": "13天前", "cnt": 2082, "fS": 1,
                     "sS": 0},
                    {"uuid": 386, "cN": "第385章 完全配得上她", "id": "33810987634134416", "uT": "13天前", "cnt": 2055, "fS": 1,
                     "sS": 0},
                    {"uuid": 387, "cN": "第386章 备注老婆", "id": "33811002659687743", "uT": "13天前", "cnt": 2089, "fS": 1,
                     "sS": 0},
                    {"uuid": 388, "cN": "第387章 随你！", "id": "33833352331268061", "uT": "12天前", "cnt": 2076, "fS": 1,
                     "sS": 0},
                    {"uuid": 389, "cN": "第388章 傅芊芊就是裴烨的劫", "id": "33833366032317868", "uT": "12天前", "cnt": 2030,
                     "fS": 1, "sS": 0},
                    {"uuid": 390, "cN": "第389章 拇指摩挲着她耳侧的肌肤", "id": "33833383734654240", "uT": "12天前", "cnt": 2052,
                     "fS": 1, "sS": 0},
                    {"uuid": 391, "cN": "第390章 唇舌追逐游戏", "id": "33833410580643851", "uT": "12天前", "cnt": 2052, "fS": 1,
                     "sS": 0},
                    {"uuid": 392, "cN": "第391章 她的话那就是人身攻击了", "id": "33856629459280030", "uT": "11天前", "cnt": 2063,
                     "fS": 1, "sS": 0},
                    {"uuid": 393, "cN": "第392章 跟踪", "id": "33856640987620121", "uT": "11天前", "cnt": 2015, "fS": 1,
                     "sS": 0},
                    {"uuid": 394, "cN": "第393章 太禽兽了", "id": "33856656555804862", "uT": "11天前", "cnt": 2059, "fS": 1,
                     "sS": 0},
                    {"uuid": 395, "cN": "第394章 你的婚姻状态不对！", "id": "33856702734956114", "uT": "11天前", "cnt": 2043,
                     "fS": 1, "sS": 0},
                    {"uuid": 396, "cN": "第395章 结婚证照片", "id": "33879325681304346", "uT": "10天前", "cnt": 2101, "fS": 1,
                     "sS": 0},
                    {"uuid": 397, "cN": "第396章 我们的共同财产", "id": "33879340178485154", "uT": "10天前", "cnt": 2020, "fS": 1,
                     "sS": 0},
                    {"uuid": 398, "cN": "第397章 服了吗？", "id": "33879349289290868", "uT": "10天前", "cnt": 2030, "fS": 1,
                     "sS": 0},
                    {"uuid": 399, "cN": "第398章 老公", "id": "33879375614182568", "uT": "10天前", "cnt": 2041, "fS": 1,
                     "sS": 0},
                    {"uuid": 400, "cN": "第399章 只要能用拳头解决的事情，她绝对不会浪费时间。", "id": "33902545625436240", "uT": "9天前",
                     "cnt": 2068, "fS": 1, "sS": 0},
                    {"uuid": 401, "cN": "第400章 她……已经死了！", "id": "33902564656039218", "uT": "9天前", "cnt": 2065, "fS": 1,
                     "sS": 0},
                    {"uuid": 402, "cN": "第401章 不信的话，可以试试。", "id": "33902596604567195", "uT": "9天前", "cnt": 2093,
                     "fS": 1, "sS": 0},
                    {"uuid": 403, "cN": "第402章 只要记得，你的身后有我", "id": "33926450044711502", "uT": "8天前", "cnt": 2034,
                     "fS": 1, "sS": 0},
                    {"uuid": 404, "cN": "第403章 喘什么，好好说话！", "id": "33926466421546059", "uT": "8天前", "cnt": 2055, "fS": 1,
                     "sS": 0},
                    {"uuid": 405, "cN": "第404章 我很喜欢", "id": "33926478771226985", "uT": "8天前", "cnt": 2062, "fS": 1,
                     "sS": 0},
                    {"uuid": 406, "cN": "第405章 还欠我一个人情", "id": "33948879172189802", "uT": "7天前", "cnt": 2064, "fS": 1,
                     "sS": 0},
                    {"uuid": 407, "cN": "第406章 光明正大的登堂入室", "id": "33948889932916964", "uT": "7天前", "cnt": 2049, "fS": 1,
                     "sS": 0},
                    {"uuid": 408, "cN": "第407章 是我踹你下去，还是你自己滚下去？", "id": "33948916747267435", "uT": "7天前", "cnt": 2060,
                     "fS": 1, "sS": 0},
                    {"uuid": 409, "cN": "第408章 谁让她是他老婆的", "id": "33967408728493023", "uT": "6天前", "cnt": 2055, "fS": 1,
                     "sS": 0},
                    {"uuid": 410, "cN": "第409章 深藏不露", "id": "33967423497579802", "uT": "6天前", "cnt": 2060, "fS": 1,
                     "sS": 0},
                    {"uuid": 411, "cN": "第410章 长得丑，人又凶，还残暴", "id": "33967455977194975", "uT": "6天前", "cnt": 2080,
                     "fS": 1, "sS": 0},
                    {"uuid": 412, "cN": "第411章 极其不要脸", "id": "33995265634021542", "uT": "5天前", "cnt": 2050, "fS": 1,
                     "sS": 0},
                    {"uuid": 413, "cN": "第412章 game over", "id": "33995274233086826", "uT": "5天前", "cnt": 2055, "fS": 1,
                     "sS": 0},
                    {"uuid": 414, "cN": "第413章 好久不见！", "id": "33995285240072335", "uT": "5天前", "cnt": 2083, "fS": 1,
                     "sS": 0},
                    {"uuid": 415, "cN": "第414章 老熟人", "id": "34019849753189146", "uT": "4天前", "cnt": 2014, "fS": 1,
                     "sS": 0},
                    {"uuid": 416, "cN": "第415章 越想越兴奋", "id": "34019858629574636", "uT": "4天前", "cnt": 2043, "fS": 1,
                     "sS": 0},
                    {"uuid": 417, "cN": "第416章 傅芊芊的凌虐", "id": "34019873650666598", "uT": "4天前", "cnt": 2065, "fS": 1,
                     "sS": 0},
                    {"uuid": 418, "cN": "第417章 他的芊芊居然敢逗他", "id": "34035953725051710", "uT": "3天前", "cnt": 2073, "fS": 1,
                     "sS": 0},
                    {"uuid": 419, "cN": "第418章 浅尝辄止", "id": "34035980856382820", "uT": "3天前", "cnt": 2034, "fS": 1,
                     "sS": 0},
                    {"uuid": 420, "cN": "第419章 二女侍一夫", "id": "34036001778433538", "uT": "3天前", "cnt": 2025, "fS": 1,
                     "sS": 0},
                    {"uuid": 421, "cN": "第420章 云城的秦市长", "id": "34063162069444169", "uT": "2天前", "cnt": 2122, "fS": 1,
                     "sS": 0},
                    {"uuid": 422, "cN": "第421章 公然跟他抢老婆吗？", "id": "34063172825172506", "uT": "2天前", "cnt": 2048, "fS": 1,
                     "sS": 0},
                    {"uuid": 423, "cN": "第422章 裴烨的礼物", "id": "34063195085862318", "uT": "2天前", "cnt": 2020, "fS": 1,
                     "sS": 0},
                    {"uuid": 424, "cN": "第423章 合法的夫妻关系", "id": "34083235957281964", "uT": "1天前", "cnt": 2053, "fS": 1,
                     "sS": 0},
                    {"uuid": 425, "cN": "第424章 相当不礼貌的行为", "id": "34083245087813286", "uT": "1天前", "cnt": 2059, "fS": 1,
                     "sS": 0},
                    {"uuid": 426, "cN": "第425章 以裴太太的身份与裴烨同行", "id": "34083258762647112", "uT": "1天前", "cnt": 2110,
                     "fS": 1, "sS": 0},
                    {"uuid": 427, "cN": "第426章 咋就是这么难缠呢", "id": "34107188448231967", "uT": "14小时前", "cnt": 2070,
                     "fS": 1, "sS": 0},
                    {"uuid": 428, "cN": "第427章 爷我的春天终于要来了", "id": "34107197324617137", "uT": "14小时前", "cnt": 2052,
                     "fS": 1, "sS": 0},
                    {"uuid": 429, "cN": "第428章 因为，我们两个人是夫妻！", "id": "34107209120609864", "uT": "14小时前", "cnt": 2096,
                     "fS": 1, "sS": 0}], "vS": 1, "wC": 171668}], "chapterTotalCnt": 428}, "msg": "成功"}''')

            if res['code'] == 0:
                bookInfo['bookId'] = res['data']['bookId']
                bookInfo['bookName'] = res['data']['bookName']
                bookInfo['chapterTotalCnt'] = res['data']['chapterTotalCnt']
                bookInfo['catalog'] = res['data']['vs']
            return bookInfo
        except:
            second = random.randint(0, self.b_second * 60)
            logger.debug('\n\t[ %s ]可能被拦截了暂停 %s 秒后 抓取下一条链接 !' % (bookId, second))
            self.b_error_urls.append(bookId)
            time.sleep(second)
            return bookInfo

    def get_catalog(self, catalogData, bookId, bookName):
        links = []
        for i in catalogData:
            for j in i['cs']:
                url = self.b_host + '/chapter/' + bookId + '/' + j['id']
                links.append((j['id'], j['cN'], bookId, bookName, j['cnt'], url, j['uuid'], j['fS']))
        return links

    def saveBooks(self, data_info):
        # data_info = [('12284740304591203', '以婚谋', '99')]
        sql = "INSERT INTO `books` (`book_id`, `book_name`, `chapter_total_cnt`) VALUES (%s, %s, %s) ON DUPLICATE KEY UPDATE book_id = VALUES(book_id), book_name= VALUES(book_name),chapter_total_cnt= VALUES(chapter_total_cnt), nex = nex+1"
        return self.batchAdd(sql, data_info)

    def saveLinks(self, data_info):
        # data_info = [('31298119050333293', '第1章 楔子', '11653675004256003', '裴太太，你已婚！', 1042, 'http://www.xs8.cn/chapter/11653675004256003/31298119050333293', 1, 0)]
        sql = "INSERT INTO `links` (`catalog_Id`, `catalog_name`, `book_Id`, `book_name`, `cnt`, `url`, `uuid`, `fs`) VALUES (%s, %s, %s, %s, %s, %s, %s,%s) ON DUPLICATE KEY UPDATE catalog_Id=VALUES(catalog_Id), catalog_name=VALUES(catalog_name), book_Id=VALUES(book_Id), book_name=VALUES(book_name), cnt=VALUES(cnt), url=VALUES(url), uuid=VALUES(uuid), fs=VALUES(fs)"
        return self.batchAdd(sql, data_info)

    # 获取 没页数据 并 存入数据库
    def get_and_save(self, link, group, num, index):
        start = time.time()
        second = random.randint(0, self.b_second * 30)
        logger.info("\t第 %s 组数据，第 %s 个线程， 第 %s 本小说 [ %s ] %s 秒后开始采集..." % (group, num, index, link, second))
        time.sleep(second)
        bookInfoData = self.get_book_info(link)
        bookId = bookInfoData['bookId']
        bookName = bookInfoData['bookName']
        chapterTotalCnt = bookInfoData['chapterTotalCnt']
        bookInfo = (bookId, bookName, chapterTotalCnt)
        catalog = self.get_catalog(bookInfoData['catalog'], bookId, bookName)

        if len(catalog) > 0:
            getBooksInfoRes = self.saveBooks([bookInfo])
            getCatalogInfoRes = self.saveLinks(catalog)
            logger.info(
                '\tbookId： %s \t\t书名： 《%s》 \t\t章节数： %s \t\t已抓取章节： %s ' % (link, bookInfo[1], bookInfo[2], len(catalog)))
            if not getBooksInfoRes:
                logger.debug('\t书籍信息存储失败 : 《%s》 ' % (bookInfo[1]))
            if not getCatalogInfoRes:
                logger.debug('\t目录存储失败 : %s\n' % (len(catalog)))
                self.b_error_urls.append(link)
            else:
                self.okNum += 1
        else:
            logger.debug('\t\tbookId： %s  存储失败' % (link))

        end = time.time()
        logger.debug(
            '\t*=*=*=*= 第 %s 组数据，第 %s 个线程， 第 %s 本小说 ,链接： [ %s ] ==> 《%s》 : 开始时间：%s ： 结束时间：%s ==> 共消耗时间 ：%s 秒' % (
                group, num, index, link, bookInfo[1], float(start), float(end), int(float(end) - float(start))))

    def group_item(self, links, group, num, links_size):
        if links_size <= 0:
            return;
        i = 0
        time.sleep(15)
        for link in links:
            i += 1
            self.get_and_save(link, group, num, i)

    # 按组获取
    def section_load(self, links, group, links_size):
        if links_size <= 0:
            return;
        threads = []
        task_list = []
        task_size = math.ceil(float(links_size) / self.b_loops)
        nloops = range(self.b_loops)
        logger.info('\t\t\t第 %s 组数据，共 %s 本小说，共分为 %s 个线程,每个线程 %s 本小说。 \n' % (group, links_size, self.b_loops, task_size))
        for i in nloops:
            try:
                logger.info("\t\t\t\t\t第 %s 个 ：%s" % (i + 1, str(links[i * task_size:(i + 1) * task_size])))
                task_list.append(links[i * task_size:(i + 1) * task_size])
            except:
                logger.info("\t\t\t\t\t第 %s 个 ：%s" % (i + 1, str(links[i * task_size:])))
                task_list.append(links[i * task_size:])
        print('\n')
        for i in nloops:
            links_size = len(task_list[i])
            if links_size <= 0:
                continue
            t = threading.Thread(target=self.group_item, args=(task_list[i], group, (i + 1), links_size))
            threads.append(t)
        for i in nloops:
            links_size = len(task_list[i])
            if links_size <= 0:
                continue
            logger.info('\t开启 第 %s 组数据，第 %s 个线程，共 %s 条链接，开始抓取...' % (group, i + 1, links_size))
            threads[i].start()
        print('\n')
        for i in nloops:
            if len(task_list[i]) <= 0:
                continue
            threads[i].join()

    def contents_load(self):
        # SQL 查询语句
        if self.isOpen == 1:
            getLinksSql = "SELECT * from books WHERE book_Id='%s'" % ('12334100503759803')
        elif self.isOpen > 1:
            getLinksSql = "SELECT book_Id  FROM %s WHERE nex < %s" % (self.books_table, self.b_nex)
        else:
            getLinksSql = "SELECT book_Id FROM %s LIMIT  %s , %s" % (self.books_table, 0, 10)
        # 获取总共需要爬取的网站数（去掉已经爬取指定次数的id）
        self.b_links = self.b_links_load(self.getBookCount(getLinksSql))
        links_size = len(self.b_links)
        group_size = math.ceil(float(links_size) / self.b_pageSize)
        nloops = range(group_size)
        task_list = []
        task_size = math.ceil(float(links_size) / group_size)

        logger.info('========' * 15)
        logger.info("\t时间: %s" % (moment.now().format('YYYY-MM-DD HH:mm:ss')))
        logger.info("\t网站：%s" % (self.b_host))
        logger.info("\t\t\t本次将采集 %s 本小说目录。\n" % (links_size))
        logger.info('\t\t\t%s 本小说，共分为 %s 个组,每组 %s 本小说。 \n' % (links_size, group_size, task_size))

        for i in nloops:
            try:
                task_list.append(self.b_links[i * task_size:(i + 1) * task_size])
            except:
                task_list.append(self.b_links[i * task_size:])
        logger.info('========' * 15)
        print('\n')

        for i in nloops:
            links_size = len(task_list[i])
            if links_size <= 0:
                continue
            logger.info('************' * 15)
            logger.info('\t采集第 %s 组数据，共 【 %s 】 本小说,开始采集：' % (i + 1, links_size))
            start = time.time()
            self.section_load(task_list[i], (i + 1), links_size)
            end = time.time()
            logger.debug('\t*=*=*=*= 第 %s 组数据 : 开始时间：%s ： 结束时间：%s ==> 共消耗时间 ：%s 秒 \n' % (
                (i + 1), float(start), float(end), int(float(end) - float(start))))

    def setLinks(self):
        self.errorSize += 1
        self.b_links = self.b_error_urls.copy()
        logger.info(
            '\n\n\n\n\t\t\t抓取存在失败链接 %s 条， 现在 【 第 %s 次  】 重新抓取失败链接' % (len(self.b_error_urls), self.errorSize))
        logger.debug(str(self.b_error_urls))
        self.b_error_urls = []
        self.contents_load()
        self.isOK()

    def isOK(self):
        if self.errorSize >= self.maxErrorSize:
            return;
        if len(self.b_error_urls) > 0:
            self.setLinks()


if __name__ == '__main__':
    logName = 'getBooksCatalog_%s.txt' % moment.now().format('YYYY-MM-DD-HH-mm-ss')
    print(logName)
    logger = Logger(logname=logName, loglevel=1, logger="fox").getlog()
    start = time.time()
    logger.debug('\t\t开始时间：%s' % (float(start)))
    book = load_book('http://www.xs8.cn', 2000, 1, 200, 20, 1, 50)
    '''
        网址
        分页大小
        最小爬取过的次数
        线程数,
        抓取间隔时间 基数： 1 *10
        是否打开 真实数据抓取  0 不开，1 写死id，大于1正式抓取
        最大重新抓取数
    '''
    book.contents_load()
    book.isOK()
    end = time.time()
    logger.debug('\t\t结束时间：%s' % float(end))
    logger.info('\n\n')
    logger.info('---' * 30)
    logger.info('\t\t时  间       ：%s' % (moment.now().format('YYYY-MM-DD HH:mm:ss')))
    logger.info('\t\t消耗时间     ：%s 秒' % (int(float(end) - float(start))))
    logger.info('\t\t成功抓取链接 : %s 条' % (book.okNum))
    logger.info('\t\t失败链接     : %s 条' % (len(book.b_error_urls)))
    logger.info('\t\t失败链接     ：\n' % (book.b_error_urls))
